/* automatically generated by rust-bindgen 0.59.2 */

pub const JSC_OBJC_API_ENABLED: u32 = 0;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type size_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpaqueJSContextGroup {
    _unused: [u8; 0],
}
#[doc = " @typedef JSContextGroupRef A group that associates JavaScript contexts with one another. Contexts in the same group may share and exchange JavaScript objects."]
pub type JSContextGroupRef = *const OpaqueJSContextGroup;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpaqueJSContext {
    _unused: [u8; 0],
}
#[doc = " @typedef JSContextRef A JavaScript execution context. Holds the global object and other execution state."]
pub type JSContextRef = *const OpaqueJSContext;
#[doc = " @typedef JSGlobalContextRef A global JavaScript execution context. A JSGlobalContext is a JSContext."]
pub type JSGlobalContextRef = *mut OpaqueJSContext;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpaqueJSString {
    _unused: [u8; 0],
}
#[doc = " @typedef JSStringRef A UTF16 character buffer. The fundamental string representation in JavaScript."]
pub type JSStringRef = *mut OpaqueJSString;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpaqueJSClass {
    _unused: [u8; 0],
}
#[doc = " @typedef JSClassRef A JavaScript class. Used with JSObjectMake to construct objects with custom behavior."]
pub type JSClassRef = *mut OpaqueJSClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]

pub type JSObjectHasInstanceCallback = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: JSContextRef,
        constructor: JSObjectRef,
        possibleInstance: JSValueRef,
        exception: *mut JSValueRef,
    ) -> bool,
>;
pub type JSObjectHasInstanceCallbackEx = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: JSContextRef,
        jsClass: JSClassRef,
        constructor: JSObjectRef,
        possibleInstance: JSValueRef,
        exception: *mut JSValueRef,
    ) -> bool,
>;
#[doc = "@typedef JSObjectConvertToTypeCallback"]
#[doc = "@abstract The callback invoked when converting an object to a particular JavaScript type."]
#[doc = "@param ctx The execution context to use."]
#[doc = "@param object The JSObject to convert."]
#[doc = "@param type A JSType specifying the JavaScript type to convert to."]
#[doc = "@param exception A pointer to a JSValueRef in which to return an exception, if any."]
#[doc = "@result The objects's converted value, or NULL if the object was not converted."]
#[doc = "@discussion If you named your function ConvertToType, you would declare it like this:"]
#[doc = ""]
#[doc = "JSValueRef ConvertToType(JSContextRef ctx, JSObjectRef object, JSType type, JSValueRef* exception);"]
#[doc = ""]
#[doc = "If this function returns false, the conversion request forwards to object's parent class chain (which includes the default object class)."]
#[doc = ""]
#[doc = "This function is only invoked when converting an object to number or string. An object converted to boolean is 'true.' An object converted to object is itself."]
pub type JSObjectConvertToTypeCallback = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: JSContextRef,
        object: JSObjectRef,
        type_: JSType,
        exception: *mut JSValueRef,
    ) -> JSValueRef,
>;
pub type JSObjectConvertToTypeCallbackEx = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: JSContextRef,
        jsClass: JSClassRef,
        object: JSObjectRef,
        type_: JSType,
        exception: *mut JSValueRef,
    ) -> JSValueRef,
>;
#[doc = "@struct JSStaticValue"]
#[doc = "@abstract This structure describes a statically declared value property."]
#[doc = "@field name A null-terminated UTF8 string containing the property's name."]
#[doc = "@field getProperty A JSObjectGetPropertyCallback to invoke when getting the property's value."]
#[doc = "@field setProperty A JSObjectSetPropertyCallback to invoke when setting the property's value. May be NULL if the ReadOnly attribute is set."]
#[doc = "@field attributes A logically ORed set of JSPropertyAttributes to give to the property."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JSStaticValue {
    pub name: *const ::std::os::raw::c_char,
    pub getProperty: JSObjectGetPropertyCallback,
    pub setProperty: JSObjectSetPropertyCallback,
    pub attributes: JSPropertyAttributes,
}
#[test]
fn bindgen_test_layout_JSStaticValue() {
    assert_eq!(
        ::std::mem::size_of::<JSStaticValue>(),
        32usize,
        concat!("Size of: ", stringify!(JSStaticValue))
    );
    assert_eq!(
        ::std::mem::align_of::<JSStaticValue>(),
        8usize,
        concat!("Alignment of ", stringify!(JSStaticValue))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JSStaticValue>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JSStaticValue),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JSStaticValue>())).getProperty as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JSStaticValue),
            "::",
            stringify!(getProperty)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JSStaticValue>())).setProperty as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JSStaticValue),
            "::",
            stringify!(setProperty)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JSStaticValue>())).attributes as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JSStaticValue),
            "::",
            stringify!(attributes)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JSStaticValueEx {
    pub name: *const ::std::os::raw::c_char,
    pub getPropertyEx: JSObjectGetPropertyCallbackEx,
    pub setPropertyEx: JSObjectSetPropertyCallbackEx,
    pub attributes: JSPropertyAttributes,
}
#[test]
fn bindgen_test_layout_JSStaticValueEx() {
    assert_eq!(
        ::std::mem::size_of::<JSStaticValueEx>(),
        32usize,
        concat!("Size of: ", stringify!(JSStaticValueEx))
    );
    assert_eq!(
        ::std::mem::align_of::<JSStaticValueEx>(),
        8usize,
        concat!("Alignment of ", stringify!(JSStaticValueEx))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JSStaticValueEx>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JSStaticValueEx),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JSStaticValueEx>())).getPropertyEx as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JSStaticValueEx),
            "::",
            stringify!(getPropertyEx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JSStaticValueEx>())).setPropertyEx as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JSStaticValueEx),
            "::",
            stringify!(setPropertyEx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JSStaticValueEx>())).attributes as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JSStaticValueEx),
            "::",
            stringify!(attributes)
        )
    );
}
#[doc = "@struct JSStaticFunction"]
#[doc = "@abstract This structure describes a statically declared function property."]
#[doc = "@field name A null-terminated UTF8 string containing the property's name."]
#[doc = "@field callAsFunction A JSObjectCallAsFunctionCallback to invoke when the property is called as a function."]
#[doc = "@field attributes A logically ORed set of JSPropertyAttributes to give to the property."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JSStaticFunction {
    pub name: *const ::std::os::raw::c_char,
    pub callAsFunction: JSObjectCallAsFunctionCallback,
    pub attributes: JSPropertyAttributes,
}
#[test]
fn bindgen_test_layout_JSStaticFunction() {
    assert_eq!(
        ::std::mem::size_of::<JSStaticFunction>(),
        24usize,
        concat!("Size of: ", stringify!(JSStaticFunction))
    );
    assert_eq!(
        ::std::mem::align_of::<JSStaticFunction>(),
        8usize,
        concat!("Alignment of ", stringify!(JSStaticFunction))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JSStaticFunction>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JSStaticFunction),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JSStaticFunction>())).callAsFunction as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JSStaticFunction),
            "::",
            stringify!(callAsFunction)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JSStaticFunction>())).attributes as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JSStaticFunction),
            "::",
            stringify!(attributes)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JSStaticFunctionEx {
    pub name: *const ::std::os::raw::c_char,
    pub callAsFunctionEx: JSObjectCallAsFunctionCallbackEx,
    pub attributes: JSPropertyAttributes,
}
#[test]
fn bindgen_test_layout_JSStaticFunctionEx() {
    assert_eq!(
        ::std::mem::size_of::<JSStaticFunctionEx>(),
        24usize,
        concat!("Size of: ", stringify!(JSStaticFunctionEx))
    );
    assert_eq!(
        ::std::mem::align_of::<JSStaticFunctionEx>(),
        8usize,
        concat!("Alignment of ", stringify!(JSStaticFunctionEx))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JSStaticFunctionEx>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JSStaticFunctionEx),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSStaticFunctionEx>())).callAsFunctionEx as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JSStaticFunctionEx),
            "::",
            stringify!(callAsFunctionEx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JSStaticFunctionEx>())).attributes as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JSStaticFunctionEx),
            "::",
            stringify!(attributes)
        )
    );
}
#[doc = "@struct JSClassDefinition"]
#[doc = "@abstract This structure contains properties and callbacks that define a type of object. All fields other than the version field are optional. Any pointer may be NULL."]
#[doc = "@field version The version number of this structure. The current version is 0."]
#[doc = "@field attributes A logically ORed set of JSClassAttributes to give to the class."]
#[doc = "@field className A null-terminated UTF8 string containing the class's name."]
#[doc = "@field parentClass A JSClass to set as the class's parent class. Pass NULL use the default object class."]
#[doc = "@field staticValues A JSStaticValue array containing the class's statically declared value properties. Pass NULL to specify no statically declared value properties. The array must be terminated by a JSStaticValue whose name field is NULL."]
#[doc = "@field staticFunctions A JSStaticFunction array containing the class's statically declared function properties. Pass NULL to specify no statically declared function properties. The array must be terminated by a JSStaticFunction whose name field is NULL."]
#[doc = "@field initialize The callback invoked when an object is first created. Use this callback to initialize the object."]
#[doc = "@field finalize The callback invoked when an object is finalized (prepared for garbage collection). Use this callback to release resources allocated for the object, and perform other cleanup."]
#[doc = "@field hasProperty The callback invoked when determining whether an object has a property. If this field is NULL, getProperty is called instead. The hasProperty callback enables optimization in cases where only a property's existence needs to be known, not its value, and computing its value is expensive."]
#[doc = "@field getProperty The callback invoked when getting a property's value."]
#[doc = "@field setProperty The callback invoked when setting a property's value."]
#[doc = "@field deleteProperty The callback invoked when deleting a property."]
#[doc = "@field getPropertyNames The callback invoked when collecting the names of an object's properties."]
#[doc = "@field callAsFunction The callback invoked when an object is called as a function."]
#[doc = "@field hasInstance The callback invoked when an object is used as the target of an 'instanceof' expression."]
#[doc = "@field callAsConstructor The callback invoked when an object is used as a constructor in a 'new' expression."]
#[doc = "@field convertToType The callback invoked when converting an object to a particular JavaScript type."]
#[doc = "@discussion The staticValues and staticFunctions arrays are the simplest and most efficient means for vending custom properties. Statically declared properties autmatically service requests like getProperty, setProperty, and getPropertyNames. Property access callbacks are required only to implement unusual properties, like array indexes, whose names are not known at compile-time."]
#[doc = ""]
#[doc = "If you named your getter function \"GetX\" and your setter function \"SetX\", you would declare a JSStaticValue array containing \"X\" like this:"]
#[doc = ""]
#[doc = "JSStaticValue StaticValueArray[] = {"]
#[doc = "{ \"X\", GetX, SetX, kJSPropertyAttributeNone },"]
#[doc = "{ 0, 0, 0, 0 }"]
#[doc = "};"]
#[doc = ""]
#[doc = "Standard JavaScript practice calls for storing function objects in prototypes, so they can be shared. The default JSClass created by JSClassCreate follows this idiom, instantiating objects with a shared, automatically generating prototype containing the class's function objects. The kJSClassAttributeNoAutomaticPrototype attribute specifies that a JSClass should not automatically generate such a prototype. The resulting JSClass instantiates objects with the default object prototype, and gives each instance object its own copy of the class's function objects."]
#[doc = ""]
#[doc = "A NULL callback specifies that the default object callback should substitute, except in the case of hasProperty, where it specifies that getProperty should substitute."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct JSClassDefinition {
    pub version: ::std::os::raw::c_int,
    pub attributes: JSClassAttributes,
    pub className: *const ::std::os::raw::c_char,
    pub parentClass: JSClassRef,
    pub __bindgen_anon_1: JSClassDefinition__bindgen_ty_1,
    pub privateData: *mut ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union JSClassDefinition__bindgen_ty_1 {
    pub __bindgen_anon_1: JSClassDefinition__bindgen_ty_1__bindgen_ty_1,
    pub __bindgen_anon_2: JSClassDefinition__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JSClassDefinition__bindgen_ty_1__bindgen_ty_1 {
    pub staticValues: *const JSStaticValue,
    pub staticFunctions: *const JSStaticFunction,
    pub initialize: JSObjectInitializeCallback,
    pub finalize: JSObjectFinalizeCallback,
    pub hasProperty: JSObjectHasPropertyCallback,
    pub getProperty: JSObjectGetPropertyCallback,
    pub setProperty: JSObjectSetPropertyCallback,
    pub deleteProperty: JSObjectDeletePropertyCallback,
    pub getPropertyNames: JSObjectGetPropertyNamesCallback,
    pub callAsFunction: JSObjectCallAsFunctionCallback,
    pub callAsConstructor: JSObjectCallAsConstructorCallback,
    pub hasInstance: JSObjectHasInstanceCallback,
    pub convertToType: JSObjectConvertToTypeCallback,
}
#[test]
fn bindgen_test_layout_JSClassDefinition__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<JSClassDefinition__bindgen_ty_1__bindgen_ty_1>(),
        104usize,
        concat!(
            "Size of: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<JSClassDefinition__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_1>())).staticValues
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(staticValues)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_1>()))
                .staticFunctions as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(staticFunctions)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_1>())).initialize
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(initialize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_1>())).finalize
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(finalize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_1>())).hasProperty
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(hasProperty)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_1>())).getProperty
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(getProperty)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_1>())).setProperty
                as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(setProperty)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_1>())).deleteProperty
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(deleteProperty)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_1>()))
                .getPropertyNames as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(getPropertyNames)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_1>())).callAsFunction
                as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(callAsFunction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_1>()))
                .callAsConstructor as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(callAsConstructor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_1>())).hasInstance
                as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(hasInstance)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_1>())).convertToType
                as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(convertToType)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JSClassDefinition__bindgen_ty_1__bindgen_ty_2 {
    pub staticValuesEx: *const JSStaticValueEx,
    pub staticFunctionsEx: *const JSStaticFunctionEx,
    pub initializeEx: JSObjectInitializeCallbackEx,
    pub finalizeEx: JSObjectFinalizeCallbackEx,
    pub hasPropertyEx: JSObjectHasPropertyCallbackEx,
    pub getPropertyEx: JSObjectGetPropertyCallbackEx,
    pub setPropertyEx: JSObjectSetPropertyCallbackEx,
    pub deletePropertyEx: JSObjectDeletePropertyCallbackEx,
    pub getPropertyNamesEx: JSObjectGetPropertyNamesCallbackEx,
    pub callAsFunctionEx: JSObjectCallAsFunctionCallbackEx,
    pub callAsConstructorEx: JSObjectCallAsConstructorCallbackEx,
    pub hasInstanceEx: JSObjectHasInstanceCallbackEx,
    pub convertToTypeEx: JSObjectConvertToTypeCallbackEx,
}
#[test]
fn bindgen_test_layout_JSClassDefinition__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<JSClassDefinition__bindgen_ty_1__bindgen_ty_2>(),
        104usize,
        concat!(
            "Size of: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<JSClassDefinition__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_2>())).staticValuesEx
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(staticValuesEx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_2>()))
                .staticFunctionsEx as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(staticFunctionsEx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_2>())).initializeEx
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(initializeEx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_2>())).finalizeEx
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(finalizeEx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_2>())).hasPropertyEx
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(hasPropertyEx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_2>())).getPropertyEx
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(getPropertyEx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_2>())).setPropertyEx
                as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(setPropertyEx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_2>()))
                .deletePropertyEx as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(deletePropertyEx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_2>()))
                .getPropertyNamesEx as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(getPropertyNamesEx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_2>()))
                .callAsFunctionEx as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(callAsFunctionEx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_2>()))
                .callAsConstructorEx as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(callAsConstructorEx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_2>())).hasInstanceEx
                as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(hasInstanceEx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JSClassDefinition__bindgen_ty_1__bindgen_ty_2>()))
                .convertToTypeEx as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(convertToTypeEx)
        )
    );
}
#[test]
fn bindgen_test_layout_JSClassDefinition__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<JSClassDefinition__bindgen_ty_1>(),
        104usize,
        concat!("Size of: ", stringify!(JSClassDefinition__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<JSClassDefinition__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(JSClassDefinition__bindgen_ty_1))
    );
}
impl ::std::fmt::Debug for JSClassDefinition__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "JSClassDefinition__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_JSClassDefinition() {
    assert_eq!(
        ::std::mem::size_of::<JSClassDefinition>(),
        136usize,
        concat!("Size of: ", stringify!(JSClassDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<JSClassDefinition>(),
        8usize,
        concat!("Alignment of ", stringify!(JSClassDefinition))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JSClassDefinition>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JSClassDefinition>())).attributes as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition),
            "::",
            stringify!(attributes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JSClassDefinition>())).className as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition),
            "::",
            stringify!(className)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JSClassDefinition>())).parentClass as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition),
            "::",
            stringify!(parentClass)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JSClassDefinition>())).privateData as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(JSClassDefinition),
            "::",
            stringify!(privateData)
        )
    );
}
impl ::std::fmt::Debug for JSClassDefinition {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "JSClassDefinition {{ version: {:?}, attributes: {:?}, className: {:?}, parentClass: {:?}, __bindgen_anon_1: {:?}, privateData: {:?} }}" , self . version , self . attributes , self . className , self . parentClass , self . __bindgen_anon_1 , self . privateData)
    }
}
extern "C" {
    #[doc = "@const kJSClassDefinitionEmpty"]
    #[doc = "@abstract A JSClassDefinition structure of the current version, filled with NULL pointers and having no attributes."]
    #[doc = "@discussion Use this constant as a convenience when creating class definitions. For example, to create a class definition with only a finalize method:"]
    #[doc = ""]
    #[doc = "JSClassDefinition definition = kJSClassDefinitionEmpty;"]
    #[doc = "definition.finalize = Finalize;"]
    pub static kJSClassDefinitionEmpty: JSClassDefinition;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Creates a JavaScript class suitable for use with JSObjectMake."]
    #[doc = "@param definition A JSClassDefinition that defines the class."]
    #[doc = "@result A JSClass with the given definition. Ownership follows the Create Rule."]
    pub fn JSClassCreate(definition: *const JSClassDefinition) -> JSClassRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Retains a JavaScript class."]
    #[doc = "@param jsClass The JSClass to retain."]
    #[doc = "@result A JSClass that is the same as jsClass."]
    pub fn JSClassRetain(jsClass: JSClassRef) -> JSClassRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Releases a JavaScript class."]
    #[doc = "@param jsClass The JSClass to release."]
    pub fn JSClassRelease(jsClass: JSClassRef);
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Retrieves the private data from a class reference, only possible with classes created with version 1000 (extended callbacks)."]
    #[doc = "@param jsClass The class to get the data from"]
    #[doc = "@result The private data on the class, or NULL, if not set"]
    #[doc = "@discussion Only classes with version 1000 (extended callbacks) can store private data, for other classes always NULL will always be returned."]
    pub fn JSClassGetPrivate(jsClass: JSClassRef) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Sets the private data on a class, only possible with classes created with version 1000 (extended callbacks)."]
    #[doc = "@param jsClass The class to set the data on"]
    #[doc = "@param data A void* to set as the private data for the class"]
    #[doc = "@result true if the data has been set on the class, false if the class has not been created with version 1000 (extended callbacks)"]
    #[doc = "@discussion Only classes with version 1000 (extended callbacks) can store private data, for other classes the function always fails. The set pointer is not touched by the engine."]
    pub fn JSClassSetPrivate(jsClass: JSClassRef, data: *mut ::std::os::raw::c_void) -> bool;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Creates a JavaScript object."]
    #[doc = "@param ctx The execution context to use."]
    #[doc = "@param jsClass The JSClass to assign to the object. Pass NULL to use the default object class."]
    #[doc = "@param data A void* to set as the object's private data. Pass NULL to specify no private data."]
    #[doc = "@result A JSObject with the given class and private data."]
    #[doc = "@discussion The default object class does not allocate storage for private data, so you must provide a non-NULL jsClass to JSObjectMake if you want your object to be able to store private data."]
    #[doc = ""]
    #[doc = "data is set on the created object before the intialize methods in its class chain are called. This enables the initialize methods to retrieve and manipulate data through JSObjectGetPrivate."]
    pub fn JSObjectMake(
        ctx: JSContextRef,
        jsClass: JSClassRef,
        data: *mut ::std::os::raw::c_void,
    ) -> JSObjectRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Convenience method for creating a JavaScript function with a given callback as its implementation."]
    #[doc = "@param ctx The execution context to use."]
    #[doc = "@param name A JSString containing the function's name. This will be used when converting the function to string. Pass NULL to create an anonymous function."]
    #[doc = "@param callAsFunction The JSObjectCallAsFunctionCallback to invoke when the function is called."]
    #[doc = "@result A JSObject that is a function. The object's prototype will be the default function prototype."]
    pub fn JSObjectMakeFunctionWithCallback(
        ctx: JSContextRef,
        name: JSStringRef,
        callAsFunction: JSObjectCallAsFunctionCallback,
    ) -> JSObjectRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Convenience method for creating a JavaScript constructor."]
    #[doc = "@param ctx The execution context to use."]
    #[doc = "@param jsClass A JSClass that is the class your constructor will assign to the objects its constructs. jsClass will be used to set the constructor's .prototype property, and to evaluate 'instanceof' expressions. Pass NULL to use the default object class."]
    #[doc = "@param callAsConstructor A JSObjectCallAsConstructorCallback to invoke when your constructor is used in a 'new' expression. Pass NULL to use the default object constructor."]
    #[doc = "@result A JSObject that is a constructor. The object's prototype will be the default object prototype."]
    #[doc = "@discussion The default object constructor takes no arguments and constructs an object of class jsClass with no private data."]
    pub fn JSObjectMakeConstructor(
        ctx: JSContextRef,
        jsClass: JSClassRef,
        callAsConstructor: JSObjectCallAsConstructorCallback,
    ) -> JSObjectRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Creates a JavaScript Array object."]
    #[doc = "@param ctx The execution context to use."]
    #[doc = "@param argumentCount An integer count of the number of arguments in arguments."]
    #[doc = "@param arguments A JSValue array of data to populate the Array with. Pass NULL if argumentCount is 0."]
    #[doc = "@param exception A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result A JSObject that is an Array."]
    #[doc = "@discussion The behavior of this function does not exactly match the behavior of the built-in Array constructor. Specifically, if one argument"]
    #[doc = "is supplied, this function returns an array with one element."]
    pub fn JSObjectMakeArray(
        ctx: JSContextRef,
        argumentCount: size_t,
        arguments: *const JSValueRef,
        exception: *mut JSValueRef,
    ) -> JSObjectRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Creates a JavaScript Date object, as if by invoking the built-in Date constructor."]
    #[doc = "@param ctx The execution context to use."]
    #[doc = "@param argumentCount An integer count of the number of arguments in arguments."]
    #[doc = "@param arguments A JSValue array of arguments to pass to the Date Constructor. Pass NULL if argumentCount is 0."]
    #[doc = "@param exception A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result A JSObject that is a Date."]
    pub fn JSObjectMakeDate(
        ctx: JSContextRef,
        argumentCount: size_t,
        arguments: *const JSValueRef,
        exception: *mut JSValueRef,
    ) -> JSObjectRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Creates a JavaScript Error object, as if by invoking the built-in Error constructor."]
    #[doc = "@param ctx The execution context to use."]
    #[doc = "@param argumentCount An integer count of the number of arguments in arguments."]
    #[doc = "@param arguments A JSValue array of arguments to pass to the Error Constructor. Pass NULL if argumentCount is 0."]
    #[doc = "@param exception A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result A JSObject that is a Error."]
    pub fn JSObjectMakeError(
        ctx: JSContextRef,
        argumentCount: size_t,
        arguments: *const JSValueRef,
        exception: *mut JSValueRef,
    ) -> JSObjectRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Creates a JavaScript RegExp object, as if by invoking the built-in RegExp constructor."]
    #[doc = "@param ctx The execution context to use."]
    #[doc = "@param argumentCount An integer count of the number of arguments in arguments."]
    #[doc = "@param arguments A JSValue array of arguments to pass to the RegExp Constructor. Pass NULL if argumentCount is 0."]
    #[doc = "@param exception A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result A JSObject that is a RegExp."]
    pub fn JSObjectMakeRegExp(
        ctx: JSContextRef,
        argumentCount: size_t,
        arguments: *const JSValueRef,
        exception: *mut JSValueRef,
    ) -> JSObjectRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Creates a JavaScript promise object by invoking the provided executor."]
    #[doc = "@param ctx The execution context to use."]
    #[doc = "@param resolve A pointer to a JSObjectRef in which to store the resolve function for the new promise. Pass NULL if you do not care to store the resolve callback."]
    #[doc = "@param reject A pointer to a JSObjectRef in which to store the reject function for the new promise. Pass NULL if you do not care to store the reject callback."]
    #[doc = "@param exception A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result A JSObject that is a promise or NULL if an exception occurred."]
    pub fn JSObjectMakeDeferredPromise(
        ctx: JSContextRef,
        resolve: *mut JSObjectRef,
        reject: *mut JSObjectRef,
        exception: *mut JSValueRef,
    ) -> JSObjectRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Creates a function with a given script as its body."]
    #[doc = "@param ctx The execution context to use."]
    #[doc = "@param name A JSString containing the function's name. This will be used when converting the function to string. Pass NULL to create an anonymous function."]
    #[doc = "@param parameterCount An integer count of the number of parameter names in parameterNames."]
    #[doc = "@param parameterNames A JSString array containing the names of the function's parameters. Pass NULL if parameterCount is 0."]
    #[doc = "@param body A JSString containing the script to use as the function's body."]
    #[doc = "@param sourceURL A JSString containing a URL for the script's source file. This is only used when reporting exceptions. Pass NULL if you do not care to include source file information in exceptions."]
    #[doc = "@param startingLineNumber An integer value specifying the script's starting line number in the file located at sourceURL. This is only used when reporting exceptions. The value is one-based, so the first line is line 1 and invalid values are clamped to 1."]
    #[doc = "@param exception A pointer to a JSValueRef in which to store a syntax error exception, if any. Pass NULL if you do not care to store a syntax error exception."]
    #[doc = "@result A JSObject that is a function, or NULL if either body or parameterNames contains a syntax error. The object's prototype will be the default function prototype."]
    #[doc = "@discussion Use this method when you want to execute a script repeatedly, to avoid the cost of re-parsing the script before each execution."]
    pub fn JSObjectMakeFunction(
        ctx: JSContextRef,
        name: JSStringRef,
        parameterCount: ::std::os::raw::c_uint,
        parameterNames: *const JSStringRef,
        body: JSStringRef,
        sourceURL: JSStringRef,
        startingLineNumber: ::std::os::raw::c_int,
        exception: *mut JSValueRef,
    ) -> JSObjectRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Gets an object's prototype."]
    #[doc = "@param ctx  The execution context to use."]
    #[doc = "@param object A JSObject whose prototype you want to get."]
    #[doc = "@result A JSValue that is the object's prototype."]
    pub fn JSObjectGetPrototype(ctx: JSContextRef, object: JSObjectRef) -> JSValueRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Sets an object's prototype."]
    #[doc = "@param ctx  The execution context to use."]
    #[doc = "@param object The JSObject whose prototype you want to set."]
    #[doc = "@param value A JSValue to set as the object's prototype."]
    pub fn JSObjectSetPrototype(ctx: JSContextRef, object: JSObjectRef, value: JSValueRef);
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Tests whether an object has a given property."]
    #[doc = "@param object The JSObject to test."]
    #[doc = "@param propertyName A JSString containing the property's name."]
    #[doc = "@result true if the object has a property whose name matches propertyName, otherwise false."]
    pub fn JSObjectHasProperty(
        ctx: JSContextRef,
        object: JSObjectRef,
        propertyName: JSStringRef,
    ) -> bool;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Gets a property from an object."]
    #[doc = "@param ctx The execution context to use."]
    #[doc = "@param object The JSObject whose property you want to get."]
    #[doc = "@param propertyName A JSString containing the property's name."]
    #[doc = "@param exception A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result The property's value if object has the property, otherwise the undefined value."]
    pub fn JSObjectGetProperty(
        ctx: JSContextRef,
        object: JSObjectRef,
        propertyName: JSStringRef,
        exception: *mut JSValueRef,
    ) -> JSValueRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Sets a property on an object."]
    #[doc = "@param ctx The execution context to use."]
    #[doc = "@param object The JSObject whose property you want to set."]
    #[doc = "@param propertyName A JSString containing the property's name."]
    #[doc = "@param value A JSValueRef to use as the property's value."]
    #[doc = "@param attributes A logically ORed set of JSPropertyAttributes to give to the property."]
    #[doc = "@param exception A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    pub fn JSObjectSetProperty(
        ctx: JSContextRef,
        object: JSObjectRef,
        propertyName: JSStringRef,
        value: JSValueRef,
        attributes: JSPropertyAttributes,
        exception: *mut JSValueRef,
    );
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Deletes a property from an object."]
    #[doc = "@param ctx The execution context to use."]
    #[doc = "@param object The JSObject whose property you want to delete."]
    #[doc = "@param propertyName A JSString containing the property's name."]
    #[doc = "@param exception A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result true if the delete operation succeeds, otherwise false (for example, if the property has the kJSPropertyAttributeDontDelete attribute set)."]
    pub fn JSObjectDeleteProperty(
        ctx: JSContextRef,
        object: JSObjectRef,
        propertyName: JSStringRef,
        exception: *mut JSValueRef,
    ) -> bool;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Tests whether an object has a given property using a JSValueRef as the property key."]
    #[doc = "@param object The JSObject to test."]
    #[doc = "@param propertyKey A JSValueRef containing the property key to use when looking up the property."]
    #[doc = "@param exception A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result true if the object has a property whose name matches propertyKey, otherwise false."]
    #[doc = "@discussion This function is the same as performing \"propertyKey in object\" from JavaScript."]
    pub fn JSObjectHasPropertyForKey(
        ctx: JSContextRef,
        object: JSObjectRef,
        propertyKey: JSValueRef,
        exception: *mut JSValueRef,
    ) -> bool;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Gets a property from an object using a JSValueRef as the property key."]
    #[doc = "@param ctx The execution context to use."]
    #[doc = "@param object The JSObject whose property you want to get."]
    #[doc = "@param propertyKey A JSValueRef containing the property key to use when looking up the property."]
    #[doc = "@param exception A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result The property's value if object has the property key, otherwise the undefined value."]
    #[doc = "@discussion This function is the same as performing \"object[propertyKey]\" from JavaScript."]
    pub fn JSObjectGetPropertyForKey(
        ctx: JSContextRef,
        object: JSObjectRef,
        propertyKey: JSValueRef,
        exception: *mut JSValueRef,
    ) -> JSValueRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Sets a property on an object using a JSValueRef as the property key."]
    #[doc = "@param ctx The execution context to use."]
    #[doc = "@param object The JSObject whose property you want to set."]
    #[doc = "@param propertyKey A JSValueRef containing the property key to use when looking up the property."]
    #[doc = "@param value A JSValueRef to use as the property's value."]
    #[doc = "@param attributes A logically ORed set of JSPropertyAttributes to give to the property."]
    #[doc = "@param exception A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@discussion This function is the same as performing \"object[propertyKey] = value\" from JavaScript."]
    pub fn JSObjectSetPropertyForKey(
        ctx: JSContextRef,
        object: JSObjectRef,
        propertyKey: JSValueRef,
        value: JSValueRef,
        attributes: JSPropertyAttributes,
        exception: *mut JSValueRef,
    );
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Deletes a property from an object using a JSValueRef as the property key."]
    #[doc = "@param ctx The execution context to use."]
    #[doc = "@param object The JSObject whose property you want to delete."]
    #[doc = "@param propertyKey A JSValueRef containing the property key to use when looking up the property."]
    #[doc = "@param exception A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result true if the delete operation succeeds, otherwise false (for example, if the property has the kJSPropertyAttributeDontDelete attribute set)."]
    #[doc = "@discussion This function is the same as performing \"delete object[propertyKey]\" from JavaScript."]
    pub fn JSObjectDeletePropertyForKey(
        ctx: JSContextRef,
        object: JSObjectRef,
        propertyKey: JSValueRef,
        exception: *mut JSValueRef,
    ) -> bool;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Gets a property from an object by numeric index."]
    #[doc = "@param ctx The execution context to use."]
    #[doc = "@param object The JSObject whose property you want to get."]
    #[doc = "@param propertyIndex An integer value that is the property's name."]
    #[doc = "@param exception A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result The property's value if object has the property, otherwise the undefined value."]
    #[doc = "@discussion Calling JSObjectGetPropertyAtIndex is equivalent to calling JSObjectGetProperty with a string containing propertyIndex, but JSObjectGetPropertyAtIndex provides optimized access to numeric properties."]
    pub fn JSObjectGetPropertyAtIndex(
        ctx: JSContextRef,
        object: JSObjectRef,
        propertyIndex: ::std::os::raw::c_uint,
        exception: *mut JSValueRef,
    ) -> JSValueRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Sets a property on an object by numeric index."]
    #[doc = "@param ctx The execution context to use."]
    #[doc = "@param object The JSObject whose property you want to set."]
    #[doc = "@param propertyIndex The property's name as a number."]
    #[doc = "@param value A JSValue to use as the property's value."]
    #[doc = "@param exception A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@discussion Calling JSObjectSetPropertyAtIndex is equivalent to calling JSObjectSetProperty with a string containing propertyIndex, but JSObjectSetPropertyAtIndex provides optimized access to numeric properties."]
    pub fn JSObjectSetPropertyAtIndex(
        ctx: JSContextRef,
        object: JSObjectRef,
        propertyIndex: ::std::os::raw::c_uint,
        value: JSValueRef,
        exception: *mut JSValueRef,
    );
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Gets an object's private data."]
    #[doc = "@param object A JSObject whose private data you want to get."]
    #[doc = "@result A void* that is the object's private data, if the object has private data, otherwise NULL."]
    pub fn JSObjectGetPrivate(object: JSObjectRef) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Sets a pointer to private data on an object."]
    #[doc = "@param object The JSObject whose private data you want to set."]
    #[doc = "@param data A void* to set as the object's private data."]
    #[doc = "@result true if object can store private data, otherwise false."]
    #[doc = "@discussion The default object class does not allocate storage for private data. Only objects created with a non-NULL JSClass can store private data."]
    pub fn JSObjectSetPrivate(object: JSObjectRef, data: *mut ::std::os::raw::c_void) -> bool;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Tests whether an object can be called as a function."]
    #[doc = "@param ctx  The execution context to use."]
    #[doc = "@param object The JSObject to test."]
    #[doc = "@result true if the object can be called as a function, otherwise false."]
    pub fn JSObjectIsFunction(ctx: JSContextRef, object: JSObjectRef) -> bool;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Calls an object as a function."]
    #[doc = "@param ctx The execution context to use."]
    #[doc = "@param object The JSObject to call as a function."]
    #[doc = "@param thisObject The object to use as \"this,\" or NULL to use the global object as \"this.\""]
    #[doc = "@param argumentCount An integer count of the number of arguments in arguments."]
    #[doc = "@param arguments A JSValue array of arguments to pass to the function. Pass NULL if argumentCount is 0."]
    #[doc = "@param exception A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result The JSValue that results from calling object as a function, or NULL if an exception is thrown or object is not a function."]
    pub fn JSObjectCallAsFunction(
        ctx: JSContextRef,
        object: JSObjectRef,
        thisObject: JSObjectRef,
        argumentCount: size_t,
        arguments: *const JSValueRef,
        exception: *mut JSValueRef,
    ) -> JSValueRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Tests whether an object can be called as a constructor."]
    #[doc = "@param ctx  The execution context to use."]
    #[doc = "@param object The JSObject to test."]
    #[doc = "@result true if the object can be called as a constructor, otherwise false."]
    pub fn JSObjectIsConstructor(ctx: JSContextRef, object: JSObjectRef) -> bool;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Calls an object as a constructor."]
    #[doc = "@param ctx The execution context to use."]
    #[doc = "@param object The JSObject to call as a constructor."]
    #[doc = "@param argumentCount An integer count of the number of arguments in arguments."]
    #[doc = "@param arguments A JSValue array of arguments to pass to the constructor. Pass NULL if argumentCount is 0."]
    #[doc = "@param exception A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result The JSObject that results from calling object as a constructor, or NULL if an exception is thrown or object is not a constructor."]
    pub fn JSObjectCallAsConstructor(
        ctx: JSContextRef,
        object: JSObjectRef,
        argumentCount: size_t,
        arguments: *const JSValueRef,
        exception: *mut JSValueRef,
    ) -> JSObjectRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Gets the names of an object's enumerable properties."]
    #[doc = "@param ctx The execution context to use."]
    #[doc = "@param object The object whose property names you want to get."]
    #[doc = "@result A JSPropertyNameArray containing the names object's enumerable properties. Ownership follows the Create Rule."]
    pub fn JSObjectCopyPropertyNames(
        ctx: JSContextRef,
        object: JSObjectRef,
    ) -> JSPropertyNameArrayRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Retains a JavaScript property name array."]
    #[doc = "@param array The JSPropertyNameArray to retain."]
    #[doc = "@result A JSPropertyNameArray that is the same as array."]
    pub fn JSPropertyNameArrayRetain(array: JSPropertyNameArrayRef) -> JSPropertyNameArrayRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Releases a JavaScript property name array."]
    #[doc = "@param array The JSPropetyNameArray to release."]
    pub fn JSPropertyNameArrayRelease(array: JSPropertyNameArrayRef);
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Gets a count of the number of items in a JavaScript property name array."]
    #[doc = "@param array The array from which to retrieve the count."]
    #[doc = "@result An integer count of the number of names in array."]
    pub fn JSPropertyNameArrayGetCount(array: JSPropertyNameArrayRef) -> size_t;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Gets a property name at a given index in a JavaScript property name array."]
    #[doc = "@param array The array from which to retrieve the property name."]
    #[doc = "@param index The index of the property name to retrieve."]
    #[doc = "@result A JSStringRef containing the property name."]
    pub fn JSPropertyNameArrayGetNameAtIndex(
        array: JSPropertyNameArrayRef,
        index: size_t,
    ) -> JSStringRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Adds a property name to a JavaScript property name accumulator."]
    #[doc = "@param accumulator The accumulator object to which to add the property name."]
    #[doc = "@param propertyName The property name to add."]
    pub fn JSPropertyNameAccumulatorAddName(
        accumulator: JSPropertyNameAccumulatorRef,
        propertyName: JSStringRef,
    );
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Creates a JavaScript context group."]
    #[doc = "@discussion A JSContextGroup associates JavaScript contexts with one another."]
    #[doc = "Contexts in the same group may share and exchange JavaScript objects. Sharing and/or exchanging"]
    #[doc = "JavaScript objects between contexts in different groups will produce undefined behavior."]
    #[doc = "When objects from the same context group are used in multiple threads, explicit"]
    #[doc = "synchronization is required."]
    #[doc = ""]
    #[doc = "A JSContextGroup may need to run deferred tasks on a run loop, such as garbage collection"]
    #[doc = "or resolving WebAssembly compilations. By default, calling JSContextGroupCreate will use"]
    #[doc = "the run loop of the thread it was called on. Currently, there is no API to change a"]
    #[doc = "JSContextGroup's run loop once it has been created."]
    #[doc = "@result The created JSContextGroup."]
    pub fn JSContextGroupCreate() -> JSContextGroupRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Retains a JavaScript context group."]
    #[doc = "@param group The JSContextGroup to retain."]
    #[doc = "@result A JSContextGroup that is the same as group."]
    pub fn JSContextGroupRetain(group: JSContextGroupRef) -> JSContextGroupRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Releases a JavaScript context group."]
    #[doc = "@param group The JSContextGroup to release."]
    pub fn JSContextGroupRelease(group: JSContextGroupRef);
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Creates a global JavaScript execution context."]
    #[doc = "@discussion JSGlobalContextCreate allocates a global object and populates it with all the"]
    #[doc = "built-in JavaScript objects, such as Object, Function, String, and Array."]
    #[doc = ""]
    #[doc = "In WebKit version 4.0 and later, the context is created in a unique context group."]
    #[doc = "Therefore, scripts may execute in it concurrently with scripts executing in other contexts."]
    #[doc = "However, you may not use values created in the context in other contexts."]
    #[doc = "@param globalObjectClass The class to use when creating the global object. Pass"]
    #[doc = "NULL to use the default object class."]
    #[doc = "@result A JSGlobalContext with a global object of class globalObjectClass."]
    pub fn JSGlobalContextCreate(globalObjectClass: JSClassRef) -> JSGlobalContextRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Creates a global JavaScript execution context in the context group provided."]
    #[doc = "@discussion JSGlobalContextCreateInGroup allocates a global object and populates it with"]
    #[doc = "all the built-in JavaScript objects, such as Object, Function, String, and Array."]
    #[doc = "@param globalObjectClass The class to use when creating the global object. Pass"]
    #[doc = "NULL to use the default object class."]
    #[doc = "@param group The context group to use. The created global context retains the group."]
    #[doc = "Pass NULL to create a unique group for the context."]
    #[doc = "@result A JSGlobalContext with a global object of class globalObjectClass and a context"]
    #[doc = "group equal to group."]
    pub fn JSGlobalContextCreateInGroup(
        group: JSContextGroupRef,
        globalObjectClass: JSClassRef,
    ) -> JSGlobalContextRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Retains a global JavaScript execution context."]
    #[doc = "@param ctx The JSGlobalContext to retain."]
    #[doc = "@result A JSGlobalContext that is the same as ctx."]
    pub fn JSGlobalContextRetain(ctx: JSGlobalContextRef) -> JSGlobalContextRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Releases a global JavaScript execution context."]
    #[doc = "@param ctx The JSGlobalContext to release."]
    pub fn JSGlobalContextRelease(ctx: JSGlobalContextRef);
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Gets the global object of a JavaScript execution context."]
    #[doc = "@param ctx The JSContext whose global object you want to get."]
    #[doc = "@result ctx's global object."]
    pub fn JSContextGetGlobalObject(ctx: JSContextRef) -> JSObjectRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Gets the context group to which a JavaScript execution context belongs."]
    #[doc = "@param ctx The JSContext whose group you want to get."]
    #[doc = "@result ctx's group."]
    pub fn JSContextGetGroup(ctx: JSContextRef) -> JSContextGroupRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Gets the global context of a JavaScript execution context."]
    #[doc = "@param ctx The JSContext whose global context you want to get."]
    #[doc = "@result ctx's global context."]
    pub fn JSContextGetGlobalContext(ctx: JSContextRef) -> JSGlobalContextRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Gets a copy of the name of a context."]
    #[doc = "@param ctx The JSGlobalContext whose name you want to get."]
    #[doc = "@result The name for ctx."]
    #[doc = "@discussion A JSGlobalContext's name is exposed for remote debugging to make it"]
    #[doc = "easier to identify the context you would like to attach to."]
    pub fn JSGlobalContextCopyName(ctx: JSGlobalContextRef) -> JSStringRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Sets the remote debugging name for a context."]
    #[doc = "@param ctx The JSGlobalContext that you want to name."]
    #[doc = "@param name The remote debugging name to set on ctx."]
    pub fn JSGlobalContextSetName(ctx: JSGlobalContextRef, name: JSStringRef);
}
#[doc = "@typedef JSChar"]
#[doc = "@abstract A UTF-16 code unit. One, or a sequence of two, can encode any Unicode"]
#[doc = "character. As with all scalar types, endianness depends on the underlying"]
#[doc = "architecture."]
pub type JSChar = ::std::os::raw::c_ushort;
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract         Creates a JavaScript string from a buffer of Unicode characters."]
    #[doc = "@param chars      The buffer of Unicode characters to copy into the new JSString."]
    #[doc = "@param numChars   The number of characters to copy from the buffer pointed to by chars."]
    #[doc = "@result           A JSString containing chars. Ownership follows the Create Rule."]
    pub fn JSStringCreateWithCharacters(chars: *const JSChar, numChars: size_t) -> JSStringRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract         Creates a JavaScript string from a null-terminated UTF8 string."]
    #[doc = "@param string     The null-terminated UTF8 string to copy into the new JSString."]
    #[doc = "@result           A JSString containing string. Ownership follows the Create Rule."]
    pub fn JSStringCreateWithUTF8CString(string: *const ::std::os::raw::c_char) -> JSStringRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract         Retains a JavaScript string."]
    #[doc = "@param string     The JSString to retain."]
    #[doc = "@result           A JSString that is the same as string."]
    pub fn JSStringRetain(string: JSStringRef) -> JSStringRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract         Releases a JavaScript string."]
    #[doc = "@param string     The JSString to release."]
    pub fn JSStringRelease(string: JSStringRef);
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract         Returns the number of Unicode characters in a JavaScript string."]
    #[doc = "@param string     The JSString whose length (in Unicode characters) you want to know."]
    #[doc = "@result           The number of Unicode characters stored in string."]
    pub fn JSStringGetLength(string: JSStringRef) -> size_t;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract         Returns a pointer to the Unicode character buffer that"]
    #[doc = "serves as the backing store for a JavaScript string."]
    #[doc = "@param string     The JSString whose backing store you want to access."]
    #[doc = "@result           A pointer to the Unicode character buffer that serves as string's"]
    #[doc = "backing store, which will be deallocated when string is deallocated."]
    pub fn JSStringGetCharactersPtr(string: JSStringRef) -> *const JSChar;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Returns the maximum number of bytes a JavaScript string will"]
    #[doc = "take up if converted into a null-terminated UTF8 string."]
    #[doc = "@param string The JSString whose maximum converted size (in bytes) you"]
    #[doc = "want to know."]
    #[doc = "@result The maximum number of bytes that could be required to convert string into a"]
    #[doc = "null-terminated UTF8 string. The number of bytes that the conversion actually ends"]
    #[doc = "up requiring could be less than this, but never more."]
    pub fn JSStringGetMaximumUTF8CStringSize(string: JSStringRef) -> size_t;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract Converts a JavaScript string into a null-terminated UTF8 string,"]
    #[doc = "and copies the result into an external byte buffer."]
    #[doc = "@param string The source JSString."]
    #[doc = "@param buffer The destination byte buffer into which to copy a null-terminated"]
    #[doc = "UTF8 representation of string. On return, buffer contains a UTF8 string"]
    #[doc = "representation of string. If bufferSize is too small, buffer will contain only"]
    #[doc = "partial results. If buffer is not at least bufferSize bytes in size,"]
    #[doc = "behavior is undefined."]
    #[doc = "@param bufferSize The size of the external buffer in bytes."]
    #[doc = "@result The number of bytes written into buffer (including the null-terminator byte)."]
    pub fn JSStringGetUTF8CString(
        string: JSStringRef,
        buffer: *mut ::std::os::raw::c_char,
        bufferSize: size_t,
    ) -> size_t;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract     Tests whether two JavaScript strings match."]
    #[doc = "@param a      The first JSString to test."]
    #[doc = "@param b      The second JSString to test."]
    #[doc = "@result       true if the two strings match, otherwise false."]
    pub fn JSStringIsEqual(a: JSStringRef, b: JSStringRef) -> bool;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract     Tests whether a JavaScript string matches a null-terminated UTF8 string."]
    #[doc = "@param a      The JSString to test."]
    #[doc = "@param b      The null-terminated UTF8 string to test."]
    #[doc = "@result       true if the two strings match, otherwise false."]
    pub fn JSStringIsEqualToUTF8CString(a: JSStringRef, b: *const ::std::os::raw::c_char) -> bool;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract           Creates a JavaScript Typed Array object with the given number of elements."]
    #[doc = "@param ctx          The execution context to use."]
    #[doc = "@param arrayType    A value identifying the type of array to create. If arrayType is kJSTypedArrayTypeNone or kJSTypedArrayTypeArrayBuffer then NULL will be returned."]
    #[doc = "@param length       The number of elements to be in the new Typed Array."]
    #[doc = "@param exception    A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result             A JSObjectRef that is a Typed Array with all elements set to zero or NULL if there was an error."]
    pub fn JSObjectMakeTypedArray(
        ctx: JSContextRef,
        arrayType: JSTypedArrayType,
        length: size_t,
        exception: *mut JSValueRef,
    ) -> JSObjectRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract                 Creates a JavaScript Typed Array object from an existing pointer."]
    #[doc = "@param ctx                The execution context to use."]
    #[doc = "@param arrayType          A value identifying the type of array to create. If arrayType is kJSTypedArrayTypeNone or kJSTypedArrayTypeArrayBuffer then NULL will be returned."]
    #[doc = "@param bytes              A pointer to the byte buffer to be used as the backing store of the Typed Array object."]
    #[doc = "@param byteLength         The number of bytes pointed to by the parameter bytes."]
    #[doc = "@param bytesDeallocator   The allocator to use to deallocate the external buffer when the JSTypedArrayData object is deallocated."]
    #[doc = "@param deallocatorContext A pointer to pass back to the deallocator."]
    #[doc = "@param exception          A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result                   A JSObjectRef Typed Array whose backing store is the same as the one pointed to by bytes or NULL if there was an error."]
    #[doc = "@discussion               If an exception is thrown during this function the bytesDeallocator will always be called."]
    pub fn JSObjectMakeTypedArrayWithBytesNoCopy(
        ctx: JSContextRef,
        arrayType: JSTypedArrayType,
        bytes: *mut ::std::os::raw::c_void,
        byteLength: size_t,
        bytesDeallocator: JSTypedArrayBytesDeallocator,
        deallocatorContext: *mut ::std::os::raw::c_void,
        exception: *mut JSValueRef,
    ) -> JSObjectRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract           Creates a JavaScript Typed Array object from an existing JavaScript Array Buffer object."]
    #[doc = "@param ctx          The execution context to use."]
    #[doc = "@param arrayType    A value identifying the type of array to create. If arrayType is kJSTypedArrayTypeNone or kJSTypedArrayTypeArrayBuffer then NULL will be returned."]
    #[doc = "@param buffer       An Array Buffer object that should be used as the backing store for the created JavaScript Typed Array object."]
    #[doc = "@param exception    A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result             A JSObjectRef that is a Typed Array or NULL if there was an error. The backing store of the Typed Array will be buffer."]
    pub fn JSObjectMakeTypedArrayWithArrayBuffer(
        ctx: JSContextRef,
        arrayType: JSTypedArrayType,
        buffer: JSObjectRef,
        exception: *mut JSValueRef,
    ) -> JSObjectRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract           Creates a JavaScript Typed Array object from an existing JavaScript Array Buffer object with the given offset and length."]
    #[doc = "@param ctx          The execution context to use."]
    #[doc = "@param arrayType    A value identifying the type of array to create. If arrayType is kJSTypedArrayTypeNone or kJSTypedArrayTypeArrayBuffer then NULL will be returned."]
    #[doc = "@param buffer       An Array Buffer object that should be used as the backing store for the created JavaScript Typed Array object."]
    #[doc = "@param byteOffset   The byte offset for the created Typed Array. byteOffset should aligned with the element size of arrayType."]
    #[doc = "@param length       The number of elements to include in the Typed Array."]
    #[doc = "@param exception    A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result             A JSObjectRef that is a Typed Array or NULL if there was an error. The backing store of the Typed Array will be buffer."]
    pub fn JSObjectMakeTypedArrayWithArrayBufferAndOffset(
        ctx: JSContextRef,
        arrayType: JSTypedArrayType,
        buffer: JSObjectRef,
        byteOffset: size_t,
        length: size_t,
        exception: *mut JSValueRef,
    ) -> JSObjectRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract           Returns a temporary pointer to the backing store of a JavaScript Typed Array object."]
    #[doc = "@param ctx          The execution context to use."]
    #[doc = "@param object       The Typed Array object whose backing store pointer to return."]
    #[doc = "@param exception    A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result             A pointer to the raw data buffer that serves as object's backing store or NULL if object is not a Typed Array object."]
    #[doc = "@discussion         The pointer returned by this function is temporary and is not guaranteed to remain valid across JavaScriptCore API calls."]
    pub fn JSObjectGetTypedArrayBytesPtr(
        ctx: JSContextRef,
        object: JSObjectRef,
        exception: *mut JSValueRef,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract           Returns the length of a JavaScript Typed Array object."]
    #[doc = "@param ctx          The execution context to use."]
    #[doc = "@param object       The Typed Array object whose length to return."]
    #[doc = "@param exception    A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result             The length of the Typed Array object or 0 if the object is not a Typed Array object."]
    pub fn JSObjectGetTypedArrayLength(
        ctx: JSContextRef,
        object: JSObjectRef,
        exception: *mut JSValueRef,
    ) -> size_t;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract           Returns the byte length of a JavaScript Typed Array object."]
    #[doc = "@param ctx          The execution context to use."]
    #[doc = "@param object       The Typed Array object whose byte length to return."]
    #[doc = "@param exception    A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result             The byte length of the Typed Array object or 0 if the object is not a Typed Array object."]
    pub fn JSObjectGetTypedArrayByteLength(
        ctx: JSContextRef,
        object: JSObjectRef,
        exception: *mut JSValueRef,
    ) -> size_t;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract           Returns the byte offset of a JavaScript Typed Array object."]
    #[doc = "@param ctx          The execution context to use."]
    #[doc = "@param object       The Typed Array object whose byte offset to return."]
    #[doc = "@param exception    A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result             The byte offset of the Typed Array object or 0 if the object is not a Typed Array object."]
    pub fn JSObjectGetTypedArrayByteOffset(
        ctx: JSContextRef,
        object: JSObjectRef,
        exception: *mut JSValueRef,
    ) -> size_t;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract           Returns the JavaScript Array Buffer object that is used as the backing of a JavaScript Typed Array object."]
    #[doc = "@param ctx          The execution context to use."]
    #[doc = "@param object       The JSObjectRef whose Typed Array type data pointer to obtain."]
    #[doc = "@param exception    A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result             A JSObjectRef with a JSTypedArrayType of kJSTypedArrayTypeArrayBuffer or NULL if object is not a Typed Array."]
    pub fn JSObjectGetTypedArrayBuffer(
        ctx: JSContextRef,
        object: JSObjectRef,
        exception: *mut JSValueRef,
    ) -> JSObjectRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract                 Creates a JavaScript Array Buffer object from an existing pointer."]
    #[doc = "@param ctx                The execution context to use."]
    #[doc = "@param bytes              A pointer to the byte buffer to be used as the backing store of the Typed Array object."]
    #[doc = "@param byteLength         The number of bytes pointed to by the parameter bytes."]
    #[doc = "@param bytesDeallocator   The allocator to use to deallocate the external buffer when the Typed Array data object is deallocated."]
    #[doc = "@param deallocatorContext A pointer to pass back to the deallocator."]
    #[doc = "@param exception          A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result                   A JSObjectRef Array Buffer whose backing store is the same as the one pointed to by bytes or NULL if there was an error."]
    #[doc = "@discussion               If an exception is thrown during this function the bytesDeallocator will always be called."]
    pub fn JSObjectMakeArrayBufferWithBytesNoCopy(
        ctx: JSContextRef,
        bytes: *mut ::std::os::raw::c_void,
        byteLength: size_t,
        bytesDeallocator: JSTypedArrayBytesDeallocator,
        deallocatorContext: *mut ::std::os::raw::c_void,
        exception: *mut JSValueRef,
    ) -> JSObjectRef;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract         Returns a pointer to the data buffer that serves as the backing store for a JavaScript Typed Array object."]
    #[doc = "@param object     The Array Buffer object whose internal backing store pointer to return."]
    #[doc = "@param exception  A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result           A pointer to the raw data buffer that serves as object's backing store or NULL if object is not an Array Buffer object."]
    #[doc = "@discussion       The pointer returned by this function is temporary and is not guaranteed to remain valid across JavaScriptCore API calls."]
    pub fn JSObjectGetArrayBufferBytesPtr(
        ctx: JSContextRef,
        object: JSObjectRef,
        exception: *mut JSValueRef,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "@function"]
    #[doc = "@abstract         Returns the number of bytes in a JavaScript data object."]
    #[doc = "@param ctx        The execution context to use."]
    #[doc = "@param object     The JS Arary Buffer object whose length in bytes to return."]
    #[doc = "@param exception  A pointer to a JSValueRef in which to store an exception, if any. Pass NULL if you do not care to store an exception."]
    #[doc = "@result           The number of bytes stored in the data object."]
    pub fn JSObjectGetArrayBufferByteLength(
        ctx: JSContextRef,
        object: JSObjectRef,
        exception: *mut JSValueRef,
    ) -> size_t;
}
pub type ULChar16 = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct C_Config {
    _unused: [u8; 0],
}
pub type ULConfig = *mut C_Config;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct C_Renderer {
    _unused: [u8; 0],
}
pub type ULRenderer = *mut C_Renderer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct C_Session {
    _unused: [u8; 0],
}
pub type ULSession = *mut C_Session;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct C_ViewConfig {
    _unused: [u8; 0],
}
pub type ULViewConfig = *mut C_ViewConfig;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct C_View {
    _unused: [u8; 0],
}
pub type ULView = *mut C_View;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct C_Bitmap {
    _unused: [u8; 0],
}
pub type ULBitmap = *mut C_Bitmap;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct C_String {
    _unused: [u8; 0],
}
pub type ULString = *mut C_String;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct C_Buffer {
    _unused: [u8; 0],
}
pub type ULBuffer = *mut C_Buffer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct C_KeyEvent {
    _unused: [u8; 0],
}
pub type ULKeyEvent = *mut C_KeyEvent;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct C_MouseEvent {
    _unused: [u8; 0],
}
pub type ULMouseEvent = *mut C_MouseEvent;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct C_ScrollEvent {
    _unused: [u8; 0],
}
pub type ULScrollEvent = *mut C_ScrollEvent;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct C_Surface {
    _unused: [u8; 0],
}
pub type ULSurface = *mut C_Surface;
pub type ULBitmapSurface = *mut C_Surface;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct C_FontFile {
    _unused: [u8; 0],
}
pub type ULFontFile = *mut C_FontFile;
pub const ULMessageSource_kMessageSource_XML: ULMessageSource = 0;
pub const ULMessageSource_kMessageSource_JS: ULMessageSource = 1;
pub const ULMessageSource_kMessageSource_Network: ULMessageSource = 2;
pub const ULMessageSource_kMessageSource_ConsoleAPI: ULMessageSource = 3;
pub const ULMessageSource_kMessageSource_Storage: ULMessageSource = 4;
pub const ULMessageSource_kMessageSource_AppCache: ULMessageSource = 5;
pub const ULMessageSource_kMessageSource_Rendering: ULMessageSource = 6;
pub const ULMessageSource_kMessageSource_CSS: ULMessageSource = 7;
pub const ULMessageSource_kMessageSource_Security: ULMessageSource = 8;
pub const ULMessageSource_kMessageSource_ContentBlocker: ULMessageSource = 9;
pub const ULMessageSource_kMessageSource_Other: ULMessageSource = 10;
pub type ULMessageSource = ::std::os::raw::c_uint;
pub const ULMessageLevel_kMessageLevel_Log: ULMessageLevel = 1;
pub const ULMessageLevel_kMessageLevel_Warning: ULMessageLevel = 2;
pub const ULMessageLevel_kMessageLevel_Error: ULMessageLevel = 3;
pub const ULMessageLevel_kMessageLevel_Debug: ULMessageLevel = 4;
pub const ULMessageLevel_kMessageLevel_Info: ULMessageLevel = 5;
pub type ULMessageLevel = ::std::os::raw::c_uint;
pub const ULCursor_kCursor_Pointer: ULCursor = 0;
pub const ULCursor_kCursor_Cross: ULCursor = 1;
pub const ULCursor_kCursor_Hand: ULCursor = 2;
pub const ULCursor_kCursor_IBeam: ULCursor = 3;
pub const ULCursor_kCursor_Wait: ULCursor = 4;
pub const ULCursor_kCursor_Help: ULCursor = 5;
pub const ULCursor_kCursor_EastResize: ULCursor = 6;
pub const ULCursor_kCursor_NorthResize: ULCursor = 7;
pub const ULCursor_kCursor_NorthEastResize: ULCursor = 8;
pub const ULCursor_kCursor_NorthWestResize: ULCursor = 9;
pub const ULCursor_kCursor_SouthResize: ULCursor = 10;
pub const ULCursor_kCursor_SouthEastResize: ULCursor = 11;
pub const ULCursor_kCursor_SouthWestResize: ULCursor = 12;
pub const ULCursor_kCursor_WestResize: ULCursor = 13;
pub const ULCursor_kCursor_NorthSouthResize: ULCursor = 14;
pub const ULCursor_kCursor_EastWestResize: ULCursor = 15;
pub const ULCursor_kCursor_NorthEastSouthWestResize: ULCursor = 16;
pub const ULCursor_kCursor_NorthWestSouthEastResize: ULCursor = 17;
pub const ULCursor_kCursor_ColumnResize: ULCursor = 18;
pub const ULCursor_kCursor_RowResize: ULCursor = 19;
pub const ULCursor_kCursor_MiddlePanning: ULCursor = 20;
pub const ULCursor_kCursor_EastPanning: ULCursor = 21;
pub const ULCursor_kCursor_NorthPanning: ULCursor = 22;
pub const ULCursor_kCursor_NorthEastPanning: ULCursor = 23;
pub const ULCursor_kCursor_NorthWestPanning: ULCursor = 24;
pub const ULCursor_kCursor_SouthPanning: ULCursor = 25;
pub const ULCursor_kCursor_SouthEastPanning: ULCursor = 26;
pub const ULCursor_kCursor_SouthWestPanning: ULCursor = 27;
pub const ULCursor_kCursor_WestPanning: ULCursor = 28;
pub const ULCursor_kCursor_Move: ULCursor = 29;
pub const ULCursor_kCursor_VerticalText: ULCursor = 30;
pub const ULCursor_kCursor_Cell: ULCursor = 31;
pub const ULCursor_kCursor_ContextMenu: ULCursor = 32;
pub const ULCursor_kCursor_Alias: ULCursor = 33;
pub const ULCursor_kCursor_Progress: ULCursor = 34;
pub const ULCursor_kCursor_NoDrop: ULCursor = 35;
pub const ULCursor_kCursor_Copy: ULCursor = 36;
pub const ULCursor_kCursor_None: ULCursor = 37;
pub const ULCursor_kCursor_NotAllowed: ULCursor = 38;
pub const ULCursor_kCursor_ZoomIn: ULCursor = 39;
pub const ULCursor_kCursor_ZoomOut: ULCursor = 40;
pub const ULCursor_kCursor_Grab: ULCursor = 41;
pub const ULCursor_kCursor_Grabbing: ULCursor = 42;
pub const ULCursor_kCursor_Custom: ULCursor = 43;
pub type ULCursor = ::std::os::raw::c_uint;
#[doc = ""]
#[doc = " Alpha channel only, 8-bits per pixel."]
#[doc = ""]
#[doc = " Encoding: 8-bits per channel, unsigned normalized."]
#[doc = ""]
#[doc = " Color-space: Linear (no gamma), alpha-coverage only."]
#[doc = ""]
pub const ULBitmapFormat_kBitmapFormat_A8_UNORM: ULBitmapFormat = 0;
#[doc = ""]
#[doc = " Blue Green Red Alpha channels, 32-bits per pixel."]
#[doc = ""]
#[doc = " Encoding: 8-bits per channel, unsigned normalized."]
#[doc = ""]
#[doc = " Color-space: sRGB gamma with premultiplied linear alpha channel."]
#[doc = ""]
pub const ULBitmapFormat_kBitmapFormat_BGRA8_UNORM_SRGB: ULBitmapFormat = 1;
pub type ULBitmapFormat = ::std::os::raw::c_uint;
#[doc = ""]
#[doc = " Key-Down event type. (Does not trigger accelerator commands in WebCore)"]
#[doc = ""]
#[doc = " @NOTE: You should probably use RawKeyDown instead when a physical key"]
#[doc = "        is pressed. This member is only here for historic compatibility"]
#[doc = "        with WebCore's key event types."]
#[doc = ""]
pub const ULKeyEventType_kKeyEventType_KeyDown: ULKeyEventType = 0;
#[doc = ""]
#[doc = " Key-Up event type. Use this when a physical key is released."]
#[doc = ""]
pub const ULKeyEventType_kKeyEventType_KeyUp: ULKeyEventType = 1;
#[doc = ""]
#[doc = " Raw Key-Down type. Use this when a physical key is pressed."]
#[doc = ""]
#[doc = " @NOTE: You should use RawKeyDown for physical key presses since it"]
#[doc = "        allows WebCore to do additional command translation."]
#[doc = ""]
pub const ULKeyEventType_kKeyEventType_RawKeyDown: ULKeyEventType = 2;
#[doc = ""]
#[doc = " Character input event type. Use this when the OS generates text from"]
#[doc = " a physical key being pressed (eg, WM_CHAR on Windows)."]
#[doc = ""]
pub const ULKeyEventType_kKeyEventType_Char: ULKeyEventType = 3;
pub type ULKeyEventType = ::std::os::raw::c_uint;
pub const ULMouseEventType_kMouseEventType_MouseMoved: ULMouseEventType = 0;
pub const ULMouseEventType_kMouseEventType_MouseDown: ULMouseEventType = 1;
pub const ULMouseEventType_kMouseEventType_MouseUp: ULMouseEventType = 2;
pub type ULMouseEventType = ::std::os::raw::c_uint;
pub const ULMouseButton_kMouseButton_None: ULMouseButton = 0;
pub const ULMouseButton_kMouseButton_Left: ULMouseButton = 1;
pub const ULMouseButton_kMouseButton_Middle: ULMouseButton = 2;
pub const ULMouseButton_kMouseButton_Right: ULMouseButton = 3;
pub type ULMouseButton = ::std::os::raw::c_uint;
pub const ULScrollEventType_kScrollEventType_ScrollByPixel: ULScrollEventType = 0;
pub const ULScrollEventType_kScrollEventType_ScrollByPage: ULScrollEventType = 1;
pub type ULScrollEventType = ::std::os::raw::c_uint;
pub const ULFaceWinding_kFaceWinding_Clockwise: ULFaceWinding = 0;
pub const ULFaceWinding_kFaceWinding_CounterClockwise: ULFaceWinding = 1;
pub type ULFaceWinding = ::std::os::raw::c_uint;
#[doc = ""]
#[doc = " Lighter hinting algorithm-- glyphs are slightly fuzzier but better"]
#[doc = " resemble their original shape. This is achieved by snapping glyphs to the"]
#[doc = " pixel grid only vertically which better preserves inter-glyph spacing."]
#[doc = ""]
pub const ULFontHinting_kFontHinting_Smooth: ULFontHinting = 0;
#[doc = ""]
#[doc = " Default hinting algorithm-- offers a good balance between sharpness and"]
#[doc = " shape at smaller font sizes."]
#[doc = ""]
pub const ULFontHinting_kFontHinting_Normal: ULFontHinting = 1;
#[doc = ""]
#[doc = " Strongest hinting algorithm-- outputs only black/white glyphs. The result"]
#[doc = " is usually unpleasant if the underlying TTF does not contain hints for"]
#[doc = " this type of rendering."]
#[doc = ""]
pub const ULFontHinting_kFontHinting_Monochrome: ULFontHinting = 2;
pub type ULFontHinting = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ULRect {
    pub left: f32,
    pub top: f32,
    pub right: f32,
    pub bottom: f32,
}
#[test]
fn bindgen_test_layout_ULRect() {
    assert_eq!(
        ::std::mem::size_of::<ULRect>(),
        16usize,
        concat!("Size of: ", stringify!(ULRect))
    );
    assert_eq!(
        ::std::mem::align_of::<ULRect>(),
        4usize,
        concat!("Alignment of ", stringify!(ULRect))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULRect>())).left as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ULRect),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULRect>())).top as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ULRect),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULRect>())).right as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ULRect),
            "::",
            stringify!(right)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULRect>())).bottom as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ULRect),
            "::",
            stringify!(bottom)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ULIntRect {
    pub left: ::std::os::raw::c_int,
    pub top: ::std::os::raw::c_int,
    pub right: ::std::os::raw::c_int,
    pub bottom: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ULIntRect() {
    assert_eq!(
        ::std::mem::size_of::<ULIntRect>(),
        16usize,
        concat!("Size of: ", stringify!(ULIntRect))
    );
    assert_eq!(
        ::std::mem::align_of::<ULIntRect>(),
        4usize,
        concat!("Alignment of ", stringify!(ULIntRect))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULIntRect>())).left as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ULIntRect),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULIntRect>())).top as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ULIntRect),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULIntRect>())).right as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ULIntRect),
            "::",
            stringify!(right)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULIntRect>())).bottom as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ULIntRect),
            "::",
            stringify!(bottom)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ULRenderTarget {
    pub is_empty: bool,
    pub width: ::std::os::raw::c_uint,
    pub height: ::std::os::raw::c_uint,
    pub texture_id: ::std::os::raw::c_uint,
    pub texture_width: ::std::os::raw::c_uint,
    pub texture_height: ::std::os::raw::c_uint,
    pub texture_format: ULBitmapFormat,
    pub uv_coords: ULRect,
    pub render_buffer_id: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_ULRenderTarget() {
    assert_eq!(
        ::std::mem::size_of::<ULRenderTarget>(),
        48usize,
        concat!("Size of: ", stringify!(ULRenderTarget))
    );
    assert_eq!(
        ::std::mem::align_of::<ULRenderTarget>(),
        4usize,
        concat!("Alignment of ", stringify!(ULRenderTarget))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULRenderTarget>())).is_empty as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ULRenderTarget),
            "::",
            stringify!(is_empty)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULRenderTarget>())).width as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ULRenderTarget),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULRenderTarget>())).height as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ULRenderTarget),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULRenderTarget>())).texture_id as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ULRenderTarget),
            "::",
            stringify!(texture_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULRenderTarget>())).texture_width as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ULRenderTarget),
            "::",
            stringify!(texture_width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULRenderTarget>())).texture_height as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ULRenderTarget),
            "::",
            stringify!(texture_height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULRenderTarget>())).texture_format as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ULRenderTarget),
            "::",
            stringify!(texture_format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULRenderTarget>())).uv_coords as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ULRenderTarget),
            "::",
            stringify!(uv_coords)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULRenderTarget>())).render_buffer_id as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ULRenderTarget),
            "::",
            stringify!(render_buffer_id)
        )
    );
}
extern "C" {
    #[doc = ""]
    #[doc = " Get the version string of the library in MAJOR.MINOR.PATCH format."]
    #[doc = ""]
    pub fn ulVersionString() -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = ""]
    #[doc = " Get the numeric major version of the library."]
    #[doc = ""]
    pub fn ulVersionMajor() -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = ""]
    #[doc = " Get the numeric minor version of the library."]
    #[doc = ""]
    pub fn ulVersionMinor() -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = ""]
    #[doc = " Get the numeric patch version of the library."]
    #[doc = ""]
    pub fn ulVersionPatch() -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = ""]
    #[doc = " Create empty bitmap."]
    #[doc = ""]
    pub fn ulCreateEmptyBitmap() -> ULBitmap;
}
extern "C" {
    #[doc = ""]
    #[doc = " Create bitmap with certain dimensions and pixel format."]
    #[doc = ""]
    pub fn ulCreateBitmap(
        width: ::std::os::raw::c_uint,
        height: ::std::os::raw::c_uint,
        format: ULBitmapFormat,
    ) -> ULBitmap;
}
extern "C" {
    #[doc = ""]
    #[doc = " Create bitmap from existing pixel buffer. @see Bitmap for help using this function."]
    #[doc = ""]
    pub fn ulCreateBitmapFromPixels(
        width: ::std::os::raw::c_uint,
        height: ::std::os::raw::c_uint,
        format: ULBitmapFormat,
        row_bytes: ::std::os::raw::c_uint,
        pixels: *const ::std::os::raw::c_void,
        size: size_t,
        should_copy: bool,
    ) -> ULBitmap;
}
extern "C" {
    #[doc = ""]
    #[doc = " Create bitmap from copy."]
    #[doc = ""]
    pub fn ulCreateBitmapFromCopy(existing_bitmap: ULBitmap) -> ULBitmap;
}
extern "C" {
    #[doc = ""]
    #[doc = " Destroy a bitmap (you should only destroy Bitmaps you have explicitly created via one of the"]
    #[doc = " creation functions above."]
    #[doc = ""]
    pub fn ulDestroyBitmap(bitmap: ULBitmap);
}
extern "C" {
    #[doc = ""]
    #[doc = " Get the width in pixels."]
    #[doc = ""]
    pub fn ulBitmapGetWidth(bitmap: ULBitmap) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = ""]
    #[doc = " Get the height in pixels."]
    #[doc = ""]
    pub fn ulBitmapGetHeight(bitmap: ULBitmap) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = ""]
    #[doc = " Get the pixel format."]
    #[doc = ""]
    pub fn ulBitmapGetFormat(bitmap: ULBitmap) -> ULBitmapFormat;
}
extern "C" {
    #[doc = ""]
    #[doc = " Get the bytes per pixel."]
    #[doc = ""]
    pub fn ulBitmapGetBpp(bitmap: ULBitmap) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = ""]
    #[doc = " Get the number of bytes per row."]
    #[doc = ""]
    pub fn ulBitmapGetRowBytes(bitmap: ULBitmap) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = ""]
    #[doc = " Get the size in bytes of the underlying pixel buffer."]
    #[doc = ""]
    pub fn ulBitmapGetSize(bitmap: ULBitmap) -> size_t;
}
extern "C" {
    #[doc = ""]
    #[doc = " Whether or not this bitmap owns its own pixel buffer."]
    #[doc = ""]
    pub fn ulBitmapOwnsPixels(bitmap: ULBitmap) -> bool;
}
extern "C" {
    #[doc = ""]
    #[doc = " Lock pixels for reading/writing, returns pointer to pixel buffer."]
    #[doc = ""]
    pub fn ulBitmapLockPixels(bitmap: ULBitmap) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = ""]
    #[doc = " Unlock pixels after locking."]
    #[doc = ""]
    pub fn ulBitmapUnlockPixels(bitmap: ULBitmap);
}
extern "C" {
    #[doc = ""]
    #[doc = " Get raw pixel buffer-- you should only call this if Bitmap is already locked."]
    #[doc = ""]
    pub fn ulBitmapRawPixels(bitmap: ULBitmap) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = ""]
    #[doc = " Whether or not this bitmap is empty."]
    #[doc = ""]
    pub fn ulBitmapIsEmpty(bitmap: ULBitmap) -> bool;
}
extern "C" {
    #[doc = ""]
    #[doc = " Reset bitmap pixels to 0."]
    #[doc = ""]
    pub fn ulBitmapErase(bitmap: ULBitmap);
}
extern "C" {
    #[doc = ""]
    #[doc = " Write bitmap to a PNG on disk."]
    #[doc = ""]
    pub fn ulBitmapWritePNG(bitmap: ULBitmap, path: *const ::std::os::raw::c_char) -> bool;
}
extern "C" {
    #[doc = ""]
    #[doc = " This converts a BGRA bitmap to RGBA bitmap and vice-versa by swapping the red and blue channels."]
    #[doc = ""]
    pub fn ulBitmapSwapRedBlueChannels(bitmap: ULBitmap);
}
pub type ulDestroyBufferCallback = ::std::option::Option<
    unsafe extern "C" fn(user_data: *mut ::std::os::raw::c_void, data: *mut ::std::os::raw::c_void),
>;
extern "C" {
    #[doc = ""]
    #[doc = " Create a Buffer from existing, user-owned data without any copies. An optional, user-supplied"]
    #[doc = " callback will be called to deallocate data upon destruction."]
    #[doc = ""]
    #[doc = " @param  data                  A pointer to the data."]
    #[doc = ""]
    #[doc = " @param  size                  Size of the data in bytes."]
    #[doc = ""]
    #[doc = " @param  user_data             Optional user data that will be passed to destruction_callback"]
    #[doc = "                               when the returned Buffer is destroyed."]
    #[doc = ""]
    #[doc = " @param  destruction_callback  Optional callback that will be called upon destruction. Pass a"]
    #[doc = "                               null pointer if you don't want to be informed of destruction."]
    #[doc = ""]
    pub fn ulCreateBuffer(
        data: *mut ::std::os::raw::c_void,
        size: size_t,
        user_data: *mut ::std::os::raw::c_void,
        destruction_callback: ulDestroyBufferCallback,
    ) -> ULBuffer;
}
extern "C" {
    #[doc = ""]
    #[doc = " Create a Buffer from existing data, a deep copy of data will be made."]
    #[doc = ""]
    pub fn ulCreateBufferFromCopy(data: *const ::std::os::raw::c_void, size: size_t) -> ULBuffer;
}
extern "C" {
    #[doc = ""]
    #[doc = " Destroy buffer (you should destroy any buffers you explicitly Create)."]
    #[doc = ""]
    pub fn ulDestroyBuffer(buffer: ULBuffer);
}
extern "C" {
    #[doc = ""]
    #[doc = " Get a pointer to the raw byte data."]
    #[doc = ""]
    pub fn ulBufferGetData(buffer: ULBuffer) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = ""]
    #[doc = " Get the size in bytes."]
    #[doc = ""]
    pub fn ulBufferGetSize(buffer: ULBuffer) -> size_t;
}
extern "C" {
    #[doc = ""]
    #[doc = " Get the user data associated with this Buffer, if any."]
    #[doc = ""]
    pub fn ulBufferGetUserData(buffer: ULBuffer) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = ""]
    #[doc = " Check whether this Buffer owns its own data (Buffer was created via ulCreateBufferFromCopy)."]
    #[doc = " If this is false, Buffer will call the user-supplied destruction callback to deallocate data"]
    #[doc = " when this Buffer instance is destroyed."]
    #[doc = ""]
    pub fn ulBufferOwnsData(buffer: ULBuffer) -> bool;
}
#[doc = ""]
#[doc = " The callback invoked when the library wants to clear the system's clipboard."]
#[doc = ""]
pub type ULClipboardClearCallback = ::std::option::Option<unsafe extern "C" fn()>;
#[doc = ""]
#[doc = " The callback invoked when the library wants to read from the system's clipboard."]
#[doc = ""]
#[doc = " You should store the result (if any) in 'result'."]
#[doc = ""]
pub type ULClipboardReadPlainTextCallback =
    ::std::option::Option<unsafe extern "C" fn(result: ULString)>;
#[doc = ""]
#[doc = " The callback invoked when the library wants to write to the system's clipboard."]
#[doc = ""]
pub type ULClipboardWritePlainTextCallback =
    ::std::option::Option<unsafe extern "C" fn(text: ULString)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ULClipboard {
    pub clear: ULClipboardClearCallback,
    pub read_plain_text: ULClipboardReadPlainTextCallback,
    pub write_plain_text: ULClipboardWritePlainTextCallback,
}
#[test]
fn bindgen_test_layout_ULClipboard() {
    assert_eq!(
        ::std::mem::size_of::<ULClipboard>(),
        24usize,
        concat!("Size of: ", stringify!(ULClipboard))
    );
    assert_eq!(
        ::std::mem::align_of::<ULClipboard>(),
        8usize,
        concat!("Alignment of ", stringify!(ULClipboard))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULClipboard>())).clear as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ULClipboard),
            "::",
            stringify!(clear)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULClipboard>())).read_plain_text as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ULClipboard),
            "::",
            stringify!(read_plain_text)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULClipboard>())).write_plain_text as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ULClipboard),
            "::",
            stringify!(write_plain_text)
        )
    );
}
extern "C" {
    #[doc = ""]
    #[doc = " Create config with default values (see <Ultralight/platform/Config.h>)."]
    #[doc = ""]
    pub fn ulCreateConfig() -> ULConfig;
}
extern "C" {
    #[doc = ""]
    #[doc = " Destroy config."]
    #[doc = ""]
    pub fn ulDestroyConfig(config: ULConfig);
}
extern "C" {
    #[doc = ""]
    #[doc = " Set the file path to a writable directory that will be used to store cookies, cached resources, and other persistent data."]
    #[doc = ""]
    #[doc = " Files are only written to disk when using a persistent Session."]
    #[doc = ""]
    pub fn ulConfigSetCachePath(config: ULConfig, cache_path: ULString);
}
extern "C" {
    #[doc = ""]
    #[doc = " The library loads bundled resources (eg, cacert.pem and other localized resources) from the"]
    #[doc = " FileSystem API (eg, `file:///resources/cacert.pem`). You can customize the prefix to use when"]
    #[doc = " loading resource URLs by modifying this setting. (Default = \"resources/\")"]
    #[doc = ""]
    pub fn ulConfigSetResourcePathPrefix(config: ULConfig, resource_path_prefix: ULString);
}
extern "C" {
    #[doc = ""]
    #[doc = " The winding order for front-facing triangles. (Default = kFaceWinding_CounterClockwise)"]
    #[doc = ""]
    #[doc = " Note: This is only used with custom GPUDrivers"]
    #[doc = ""]
    pub fn ulConfigSetFaceWinding(config: ULConfig, winding: ULFaceWinding);
}
extern "C" {
    #[doc = ""]
    #[doc = " The hinting algorithm to use when rendering fonts. (Default = kFontHinting_Normal)"]
    #[doc = " @see ULFontHinting"]
    #[doc = ""]
    pub fn ulConfigSetFontHinting(config: ULConfig, font_hinting: ULFontHinting);
}
extern "C" {
    #[doc = ""]
    #[doc = " The gamma to use when compositing font glyphs, change this value to adjust contrast (Adobe and"]
    #[doc = " Apple prefer 1.8, others may prefer 2.2). (Default = 1.8)"]
    #[doc = ""]
    pub fn ulConfigSetFontGamma(config: ULConfig, font_gamma: f64);
}
extern "C" {
    #[doc = ""]
    #[doc = " Set user stylesheet (CSS) (Default = Empty)."]
    #[doc = ""]
    pub fn ulConfigSetUserStylesheet(config: ULConfig, css_string: ULString);
}
extern "C" {
    #[doc = ""]
    #[doc = " Set whether or not we should continuously repaint any Views or compositor layers, regardless if"]
    #[doc = " they are dirty or not. This is mainly used to diagnose painting/shader issues. (Default = False)"]
    #[doc = ""]
    pub fn ulConfigSetForceRepaint(config: ULConfig, enabled: bool);
}
extern "C" {
    #[doc = ""]
    #[doc = " Set the amount of time to wait before triggering another repaint when a CSS animation is active."]
    #[doc = " (Default = 1.0 / 60.0)"]
    #[doc = ""]
    pub fn ulConfigSetAnimationTimerDelay(config: ULConfig, delay: f64);
}
extern "C" {
    #[doc = ""]
    #[doc = " When a smooth scroll animation is active, the amount of time (in seconds) to wait before"]
    #[doc = " triggering another repaint. Default is 60 Hz."]
    #[doc = ""]
    pub fn ulConfigSetScrollTimerDelay(config: ULConfig, delay: f64);
}
extern "C" {
    #[doc = ""]
    #[doc = " The amount of time (in seconds) to wait before running the recycler (will attempt to return"]
    #[doc = " excess memory back to the system). (Default = 4.0)"]
    #[doc = ""]
    pub fn ulConfigSetRecycleDelay(config: ULConfig, delay: f64);
}
extern "C" {
    #[doc = ""]
    #[doc = " Set the size of WebCore's memory cache for decoded images, scripts, and other assets in bytes."]
    #[doc = " (Default = 64 * 1024 * 1024)"]
    #[doc = ""]
    pub fn ulConfigSetMemoryCacheSize(config: ULConfig, size: ::std::os::raw::c_uint);
}
extern "C" {
    #[doc = ""]
    #[doc = " Set the number of pages to keep in the cache. (Default = 0)"]
    #[doc = ""]
    pub fn ulConfigSetPageCacheSize(config: ULConfig, size: ::std::os::raw::c_uint);
}
extern "C" {
    #[doc = ""]
    #[doc = " JavaScriptCore tries to detect the system's physical RAM size to set reasonable allocation"]
    #[doc = " limits. Set this to anything other than 0 to override the detected value. Size is in bytes."]
    #[doc = ""]
    #[doc = " This can be used to force JavaScriptCore to be more conservative with its allocation strategy"]
    #[doc = " (at the cost of some performance)."]
    #[doc = ""]
    pub fn ulConfigSetOverrideRAMSize(config: ULConfig, size: ::std::os::raw::c_uint);
}
extern "C" {
    #[doc = ""]
    #[doc = " The minimum size of large VM heaps in JavaScriptCore. Set this to a lower value to make these"]
    #[doc = " heaps start with a smaller initial value."]
    #[doc = ""]
    pub fn ulConfigSetMinLargeHeapSize(config: ULConfig, size: ::std::os::raw::c_uint);
}
extern "C" {
    #[doc = ""]
    #[doc = " The minimum size of small VM heaps in JavaScriptCore. Set this to a lower value to make these"]
    #[doc = " heaps start with a smaller initial value."]
    #[doc = ""]
    pub fn ulConfigSetMinSmallHeapSize(config: ULConfig, size: ::std::os::raw::c_uint);
}
extern "C" {
    #[doc = ""]
    #[doc = " The number of threads to use in the Renderer (for parallel painting on the CPU, etc.)."]
    #[doc = ""]
    #[doc = " You can set this to a certain number to limit the number of threads to spawn."]
    #[doc = ""]
    #[doc = " @note  If this value is 0 (the default), the number of threads will be determined at runtime"]
    #[doc = "        using the following formula:"]
    #[doc = ""]
    #[doc = "        max(PhysicalProcessorCount() - 1, 1)"]
    #[doc = ""]
    pub fn ulConfigSetNumRendererThreads(
        config: ULConfig,
        num_renderer_threads: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[doc = ""]
    #[doc = " The max amount of time (in seconds) to allow Renderer::Update to run per call. The library will"]
    #[doc = " attempt to throttle timers and/or reschedule work if this time budget is exceeded. (Default ="]
    #[doc = " 0.01)"]
    #[doc = ""]
    pub fn ulConfigSetMaxUpdateTime(config: ULConfig, max_update_time: f64);
}
extern "C" {
    #[doc = ""]
    #[doc = " The alignment (in bytes) of the BitmapSurface when using the CPU renderer."]
    #[doc = ""]
    #[doc = " The underlying bitmap associated with each BitmapSurface will have row_bytes padded to reach"]
    #[doc = " this alignment."]
    #[doc = ""]
    #[doc = " Aligning the bitmap helps improve performance when using the CPU renderer. Determining the"]
    #[doc = " proper value to use depends on the CPU architecture and max SIMD instruction set used."]
    #[doc = ""]
    #[doc = " We generally target the 128-bit SSE2 instruction set across most PC platforms so '16' is a safe"]
    #[doc = " value to use."]
    #[doc = ""]
    #[doc = " You can set this to '0' to perform no padding (row_bytes will always be width * 4) at a slight"]
    #[doc = " cost to performance."]
    #[doc = ""]
    #[doc = " (Default = 16)"]
    #[doc = ""]
    pub fn ulConfigSetBitmapAlignment(config: ULConfig, bitmap_alignment: f64);
}
#[doc = ""]
#[doc = " The callback invoked when the FileSystem wants to check if a file path exists, return true if it"]
#[doc = " exists."]
#[doc = ""]
pub type ULFileSystemFileExistsCallback =
    ::std::option::Option<unsafe extern "C" fn(path: ULString) -> bool>;
#[doc = ""]
#[doc = " Get the mime-type of the file (eg \"text/html\")."]
#[doc = ""]
#[doc = " This is usually determined by analyzing the file extension."]
#[doc = ""]
#[doc = " If a mime-type cannot be determined, you should return \"application/unknown\" for this value."]
#[doc = ""]
#[doc = " The library will consume the result and call ulDestroyString() after this call returns."]
#[doc = ""]
pub type ULFileSystemGetFileMimeTypeCallback =
    ::std::option::Option<unsafe extern "C" fn(path: ULString) -> ULString>;
#[doc = ""]
#[doc = " Get the charset / encoding of the file (eg \"utf-8\")."]
#[doc = ""]
#[doc = " This is only important for text-based files and is usually determined by analyzing the"]
#[doc = " contents of the file."]
#[doc = ""]
#[doc = " If a charset cannot be determined, it's usually safe to return \"utf-8\" for this value."]
#[doc = ""]
#[doc = " The library will consume the result and call ulDestroyString() after this call returns."]
#[doc = ""]
pub type ULFileSystemGetFileCharsetCallback =
    ::std::option::Option<unsafe extern "C" fn(path: ULString) -> ULString>;
#[doc = ""]
#[doc = " Open file for reading and map it to a Buffer."]
#[doc = ""]
#[doc = " To minimize copies, you should map the requested file into memory and use ulBufferCreate()"]
#[doc = " to wrap the data pointer (unmapping should be performed in the destruction callback)."]
#[doc = ""]
#[doc = " If the file was unable to be opened, you should return NULL for this value."]
#[doc = ""]
pub type ULFileSystemOpenFileCallback =
    ::std::option::Option<unsafe extern "C" fn(path: ULString) -> ULBuffer>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ULFileSystem {
    pub file_exists: ULFileSystemFileExistsCallback,
    pub get_file_mime_type: ULFileSystemGetFileMimeTypeCallback,
    pub get_file_charset: ULFileSystemGetFileCharsetCallback,
    pub open_file: ULFileSystemOpenFileCallback,
}
#[test]
fn bindgen_test_layout_ULFileSystem() {
    assert_eq!(
        ::std::mem::size_of::<ULFileSystem>(),
        32usize,
        concat!("Size of: ", stringify!(ULFileSystem))
    );
    assert_eq!(
        ::std::mem::align_of::<ULFileSystem>(),
        8usize,
        concat!("Alignment of ", stringify!(ULFileSystem))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULFileSystem>())).file_exists as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ULFileSystem),
            "::",
            stringify!(file_exists)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULFileSystem>())).get_file_mime_type as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ULFileSystem),
            "::",
            stringify!(get_file_mime_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULFileSystem>())).get_file_charset as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ULFileSystem),
            "::",
            stringify!(get_file_charset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULFileSystem>())).open_file as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ULFileSystem),
            "::",
            stringify!(open_file)
        )
    );
}
extern "C" {
    #[doc = ""]
    #[doc = " Create string from null-terminated ASCII C-string."]
    #[doc = ""]
    pub fn ulCreateString(str_: *const ::std::os::raw::c_char) -> ULString;
}
extern "C" {
    #[doc = ""]
    #[doc = " Create string from UTF-8 buffer."]
    #[doc = ""]
    pub fn ulCreateStringUTF8(str_: *const ::std::os::raw::c_char, len: size_t) -> ULString;
}
extern "C" {
    #[doc = ""]
    #[doc = " Create string from UTF-16 buffer."]
    #[doc = ""]
    pub fn ulCreateStringUTF16(str_: *mut ULChar16, len: size_t) -> ULString;
}
extern "C" {
    #[doc = ""]
    #[doc = " Create string from copy of existing string."]
    #[doc = ""]
    pub fn ulCreateStringFromCopy(str_: ULString) -> ULString;
}
extern "C" {
    #[doc = ""]
    #[doc = " Destroy string (you should destroy any strings you explicitly Create)."]
    #[doc = ""]
    pub fn ulDestroyString(str_: ULString);
}
extern "C" {
    #[doc = ""]
    #[doc = " Get native UTF-8 buffer data (always null-terminated)."]
    #[doc = ""]
    pub fn ulStringGetData(str_: ULString) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = ""]
    #[doc = " Get length (in bytes) of the UTF-8 buffer data, not including null terminator."]
    #[doc = ""]
    pub fn ulStringGetLength(str_: ULString) -> size_t;
}
extern "C" {
    #[doc = ""]
    #[doc = " Whether this string is empty or not."]
    #[doc = ""]
    pub fn ulStringIsEmpty(str_: ULString) -> bool;
}
extern "C" {
    #[doc = ""]
    #[doc = " Replaces the contents of 'str' with the contents of 'new_str'"]
    #[doc = ""]
    pub fn ulStringAssignString(str_: ULString, new_str: ULString);
}
extern "C" {
    #[doc = ""]
    #[doc = " Replaces the contents of 'str' with the contents of a C-string."]
    #[doc = ""]
    pub fn ulStringAssignCString(str_: ULString, c_str: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = ""]
    #[doc = " Create a font file from an on-disk file path."]
    #[doc = ""]
    #[doc = " @note  The file path should already exist."]
    #[doc = ""]
    pub fn ulFontFileCreateFromFilePath(file_path: ULString) -> ULFontFile;
}
extern "C" {
    #[doc = ""]
    #[doc = " Create a font file from an in-memory buffer."]
    #[doc = ""]
    pub fn ulFontFileCreateFromBuffer(buffer: ULBuffer) -> ULFontFile;
}
extern "C" {
    #[doc = ""]
    #[doc = " Destroy font file"]
    #[doc = ""]
    pub fn ulDestroyFontFile(font_file: ULFontFile);
}
#[doc = ""]
#[doc = " Fallback font family name. Will be used if all other fonts fail to load."]
#[doc = ""]
#[doc = " @note  This font should be guaranteed to exist (eg, ULFontLoader::load should not fail when"]
#[doc = "        when passed this font family name)."]
#[doc = ""]
#[doc = " @note  The returned ULString instance will be consumed (ulDestroyString will be called on it)."]
#[doc = ""]
pub type ULFontLoaderGetFallbackFont = ::std::option::Option<unsafe extern "C" fn() -> ULString>;
#[doc = ""]
#[doc = " Fallback font family name that can render the specified characters. This is mainly used to"]
#[doc = " support CJK (Chinese, Japanese, Korean) text display."]
#[doc = ""]
#[doc = " @param  characters  One or more UTF-16 characters. This is almost always a single character."]
#[doc = ""]
#[doc = " @param  weight      Font weight."]
#[doc = ""]
#[doc = " @param  italic      Whether or not italic is requested."]
#[doc = ""]
#[doc = " @return  Should return a font family name that can render the text. The returned ULString"]
#[doc = "          instance will be consumed (ulDestroyString will be called on it)."]
#[doc = ""]
pub type ULFontLoaderGetFallbackFontForCharacters = ::std::option::Option<
    unsafe extern "C" fn(
        characters: ULString,
        weight: ::std::os::raw::c_int,
        italic: bool,
    ) -> ULString,
>;
#[doc = ""]
#[doc = " Get the actual font file data (TTF/OTF) for a given font description."]
#[doc = ""]
#[doc = " @param  family  Font family name."]
#[doc = ""]
#[doc = " @param  weight  Font weight."]
#[doc = ""]
#[doc = " @param  italic  Whether or not italic is requested."]
#[doc = ""]
#[doc = " @return  A font file matching the given description (either an on-disk font filepath or an"]
#[doc = "          in-memory file buffer). You can return NULL here and the loader will fallback to"]
#[doc = "          another font."]
#[doc = ""]
pub type ULFontLoaderLoad = ::std::option::Option<
    unsafe extern "C" fn(
        family: ULString,
        weight: ::std::os::raw::c_int,
        italic: bool,
    ) -> ULFontFile,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ULFontLoader {
    pub get_fallback_font: ULFontLoaderGetFallbackFont,
    pub get_fallback_font_for_characters: ULFontLoaderGetFallbackFontForCharacters,
    pub load: ULFontLoaderLoad,
}
#[test]
fn bindgen_test_layout_ULFontLoader() {
    assert_eq!(
        ::std::mem::size_of::<ULFontLoader>(),
        24usize,
        concat!("Size of: ", stringify!(ULFontLoader))
    );
    assert_eq!(
        ::std::mem::align_of::<ULFontLoader>(),
        8usize,
        concat!("Alignment of ", stringify!(ULFontLoader))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULFontLoader>())).get_fallback_font as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ULFontLoader),
            "::",
            stringify!(get_fallback_font)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ULFontLoader>())).get_fallback_font_for_characters as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ULFontLoader),
            "::",
            stringify!(get_fallback_font_for_characters)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULFontLoader>())).load as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ULFontLoader),
            "::",
            stringify!(load)
        )
    );
}
extern "C" {
    #[doc = ""]
    #[doc = " Whether or not a ULRect is empty (all members equal to 0)"]
    #[doc = ""]
    pub fn ulRectIsEmpty(rect: ULRect) -> bool;
}
extern "C" {
    #[doc = ""]
    #[doc = " Create an empty ULRect (all members equal to 0)"]
    #[doc = ""]
    pub fn ulRectMakeEmpty() -> ULRect;
}
extern "C" {
    #[doc = ""]
    #[doc = " Whether or not a ULIntRect is empty (all members equal to 0)"]
    #[doc = ""]
    pub fn ulIntRectIsEmpty(rect: ULIntRect) -> bool;
}
extern "C" {
    #[doc = ""]
    #[doc = " Create an empty ULIntRect (all members equal to 0)"]
    #[doc = ""]
    pub fn ulIntRectMakeEmpty() -> ULIntRect;
}
#[doc = ""]
#[doc = " Render buffer description."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ULRenderBuffer {
    pub texture_id: ::std::os::raw::c_uint,
    pub width: ::std::os::raw::c_uint,
    pub height: ::std::os::raw::c_uint,
    pub has_stencil_buffer: bool,
    pub has_depth_buffer: bool,
}
#[test]
fn bindgen_test_layout_ULRenderBuffer() {
    assert_eq!(
        ::std::mem::size_of::<ULRenderBuffer>(),
        16usize,
        concat!("Size of: ", stringify!(ULRenderBuffer))
    );
    assert_eq!(
        ::std::mem::align_of::<ULRenderBuffer>(),
        4usize,
        concat!("Alignment of ", stringify!(ULRenderBuffer))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULRenderBuffer>())).texture_id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ULRenderBuffer),
            "::",
            stringify!(texture_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULRenderBuffer>())).width as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ULRenderBuffer),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULRenderBuffer>())).height as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ULRenderBuffer),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ULRenderBuffer>())).has_stencil_buffer as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ULRenderBuffer),
            "::",
            stringify!(has_stencil_buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULRenderBuffer>())).has_depth_buffer as *const _ as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(ULRenderBuffer),
            "::",
            stringify!(has_depth_buffer)
        )
    );
}
#[doc = ""]
#[doc = " Vertex layout for path vertices."]
#[doc = ""]
#[doc = " (this struct's members aligned on single-byte boundaries)"]
#[doc = ""]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ULVertex_2f_4ub_2f {
    pub pos: [f32; 2usize],
    pub color: [::std::os::raw::c_uchar; 4usize],
    pub obj: [f32; 2usize],
}
#[test]
fn bindgen_test_layout_ULVertex_2f_4ub_2f() {
    assert_eq!(
        ::std::mem::size_of::<ULVertex_2f_4ub_2f>(),
        20usize,
        concat!("Size of: ", stringify!(ULVertex_2f_4ub_2f))
    );
    assert_eq!(
        ::std::mem::align_of::<ULVertex_2f_4ub_2f>(),
        1usize,
        concat!("Alignment of ", stringify!(ULVertex_2f_4ub_2f))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULVertex_2f_4ub_2f>())).pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ULVertex_2f_4ub_2f),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULVertex_2f_4ub_2f>())).color as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ULVertex_2f_4ub_2f),
            "::",
            stringify!(color)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULVertex_2f_4ub_2f>())).obj as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ULVertex_2f_4ub_2f),
            "::",
            stringify!(obj)
        )
    );
}
#[doc = ""]
#[doc = " Vertex layout for quad vertices."]
#[doc = ""]
#[doc = " (this struct's members aligned on single-byte boundaries)"]
#[doc = ""]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ULVertex_2f_4ub_2f_2f_28f {
    pub pos: [f32; 2usize],
    pub color: [::std::os::raw::c_uchar; 4usize],
    pub tex: [f32; 2usize],
    pub obj: [f32; 2usize],
    pub data0: [f32; 4usize],
    pub data1: [f32; 4usize],
    pub data2: [f32; 4usize],
    pub data3: [f32; 4usize],
    pub data4: [f32; 4usize],
    pub data5: [f32; 4usize],
    pub data6: [f32; 4usize],
}
#[test]
fn bindgen_test_layout_ULVertex_2f_4ub_2f_2f_28f() {
    assert_eq!(
        ::std::mem::size_of::<ULVertex_2f_4ub_2f_2f_28f>(),
        140usize,
        concat!("Size of: ", stringify!(ULVertex_2f_4ub_2f_2f_28f))
    );
    assert_eq!(
        ::std::mem::align_of::<ULVertex_2f_4ub_2f_2f_28f>(),
        1usize,
        concat!("Alignment of ", stringify!(ULVertex_2f_4ub_2f_2f_28f))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULVertex_2f_4ub_2f_2f_28f>())).pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ULVertex_2f_4ub_2f_2f_28f),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULVertex_2f_4ub_2f_2f_28f>())).color as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ULVertex_2f_4ub_2f_2f_28f),
            "::",
            stringify!(color)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULVertex_2f_4ub_2f_2f_28f>())).tex as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ULVertex_2f_4ub_2f_2f_28f),
            "::",
            stringify!(tex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULVertex_2f_4ub_2f_2f_28f>())).obj as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ULVertex_2f_4ub_2f_2f_28f),
            "::",
            stringify!(obj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULVertex_2f_4ub_2f_2f_28f>())).data0 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ULVertex_2f_4ub_2f_2f_28f),
            "::",
            stringify!(data0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULVertex_2f_4ub_2f_2f_28f>())).data1 as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ULVertex_2f_4ub_2f_2f_28f),
            "::",
            stringify!(data1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULVertex_2f_4ub_2f_2f_28f>())).data2 as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(ULVertex_2f_4ub_2f_2f_28f),
            "::",
            stringify!(data2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULVertex_2f_4ub_2f_2f_28f>())).data3 as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ULVertex_2f_4ub_2f_2f_28f),
            "::",
            stringify!(data3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULVertex_2f_4ub_2f_2f_28f>())).data4 as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(ULVertex_2f_4ub_2f_2f_28f),
            "::",
            stringify!(data4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULVertex_2f_4ub_2f_2f_28f>())).data5 as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(ULVertex_2f_4ub_2f_2f_28f),
            "::",
            stringify!(data5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULVertex_2f_4ub_2f_2f_28f>())).data6 as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(ULVertex_2f_4ub_2f_2f_28f),
            "::",
            stringify!(data6)
        )
    );
}
pub const ULVertexBufferFormat_kVertexBufferFormat_2f_4ub_2f: ULVertexBufferFormat = 0;
pub const ULVertexBufferFormat_kVertexBufferFormat_2f_4ub_2f_2f_28f: ULVertexBufferFormat = 1;
#[doc = ""]
#[doc = " Vertex formats."]
#[doc = ""]
pub type ULVertexBufferFormat = ::std::os::raw::c_uint;
#[doc = ""]
#[doc = " Vertex buffer data."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ULVertexBuffer {
    pub format: ULVertexBufferFormat,
    pub size: ::std::os::raw::c_uint,
    pub data: *mut ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_ULVertexBuffer() {
    assert_eq!(
        ::std::mem::size_of::<ULVertexBuffer>(),
        16usize,
        concat!("Size of: ", stringify!(ULVertexBuffer))
    );
    assert_eq!(
        ::std::mem::align_of::<ULVertexBuffer>(),
        8usize,
        concat!("Alignment of ", stringify!(ULVertexBuffer))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULVertexBuffer>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ULVertexBuffer),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULVertexBuffer>())).size as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ULVertexBuffer),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULVertexBuffer>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ULVertexBuffer),
            "::",
            stringify!(data)
        )
    );
}
#[doc = ""]
#[doc = " Vertex index type."]
#[doc = ""]
pub type ULIndexType = ::std::os::raw::c_uint;
#[doc = ""]
#[doc = " Vertex index buffer data."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ULIndexBuffer {
    pub size: ::std::os::raw::c_uint,
    pub data: *mut ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_ULIndexBuffer() {
    assert_eq!(
        ::std::mem::size_of::<ULIndexBuffer>(),
        16usize,
        concat!("Size of: ", stringify!(ULIndexBuffer))
    );
    assert_eq!(
        ::std::mem::align_of::<ULIndexBuffer>(),
        8usize,
        concat!("Alignment of ", stringify!(ULIndexBuffer))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULIndexBuffer>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ULIndexBuffer),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULIndexBuffer>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ULIndexBuffer),
            "::",
            stringify!(data)
        )
    );
}
pub const ULShaderType_kShaderType_Fill: ULShaderType = 0;
pub const ULShaderType_kShaderType_FillPath: ULShaderType = 1;
#[doc = ""]
#[doc = " Shader types, used with ULGPUState::shader_type"]
#[doc = ""]
#[doc = " Each of these correspond to a vertex/pixel shader pair. You can find stock shader code for these"]
#[doc = " in the `shaders` folder of the AppCore repo."]
#[doc = ""]
pub type ULShaderType = ::std::os::raw::c_uint;
#[doc = ""]
#[doc = " Raw 4x4 matrix as an array of floats"]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ULMatrix4x4 {
    pub data: [f32; 16usize],
}
#[test]
fn bindgen_test_layout_ULMatrix4x4() {
    assert_eq!(
        ::std::mem::size_of::<ULMatrix4x4>(),
        64usize,
        concat!("Size of: ", stringify!(ULMatrix4x4))
    );
    assert_eq!(
        ::std::mem::align_of::<ULMatrix4x4>(),
        4usize,
        concat!("Alignment of ", stringify!(ULMatrix4x4))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULMatrix4x4>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ULMatrix4x4),
            "::",
            stringify!(data)
        )
    );
}
#[doc = ""]
#[doc = " 4-component float vector"]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ULvec4 {
    pub value: [f32; 4usize],
}
#[test]
fn bindgen_test_layout_ULvec4() {
    assert_eq!(
        ::std::mem::size_of::<ULvec4>(),
        16usize,
        concat!("Size of: ", stringify!(ULvec4))
    );
    assert_eq!(
        ::std::mem::align_of::<ULvec4>(),
        4usize,
        concat!("Alignment of ", stringify!(ULvec4))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULvec4>())).value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ULvec4),
            "::",
            stringify!(value)
        )
    );
}
#[doc = ""]
#[doc = " GPU State description."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ULGPUState {
    #[doc = " Viewport width in pixels"]
    pub viewport_width: ::std::os::raw::c_uint,
    #[doc = " Viewport height in pixels"]
    pub viewport_height: ::std::os::raw::c_uint,
    #[doc = " Transform matrix-- you should multiply this with the screen-space orthographic projection"]
    #[doc = " matrix then pass to the vertex shader."]
    pub transform: ULMatrix4x4,
    #[doc = " Whether or not we should enable texturing for the current draw command."]
    pub enable_texturing: bool,
    #[doc = " Whether or not we should enable blending for the current draw command. If blending is"]
    #[doc = " disabled, any drawn pixels should overwrite existing. Mainly used so we can modify alpha"]
    #[doc = " values of the RenderBuffer during scissored clears."]
    pub enable_blend: bool,
    #[doc = " The vertex/pixel shader program pair to use for the current draw command. You should cast this"]
    #[doc = " to ShaderType to get the corresponding enum."]
    pub shader_type: ::std::os::raw::c_uchar,
    #[doc = " The render buffer to use for the current draw command."]
    pub render_buffer_id: ::std::os::raw::c_uint,
    #[doc = " The texture id to bind to slot #1. (Will be 0 if none)"]
    pub texture_1_id: ::std::os::raw::c_uint,
    #[doc = " The texture id to bind to slot #2. (Will be 0 if none)"]
    pub texture_2_id: ::std::os::raw::c_uint,
    #[doc = " The texture id to bind to slot #3. (Will be 0 if none)"]
    pub texture_3_id: ::std::os::raw::c_uint,
    #[doc = " The following four members are passed to the pixel shader via uniforms."]
    pub uniform_scalar: [f32; 8usize],
    pub uniform_vector: [ULvec4; 8usize],
    pub clip_size: ::std::os::raw::c_uchar,
    pub clip: [ULMatrix4x4; 8usize],
    #[doc = " Whether or not scissor testing should be used for the current draw"]
    #[doc = " command."]
    pub enable_scissor: bool,
    #[doc = " The scissor rect to use for scissor testing (units in pixels)"]
    pub scissor_rect: ULIntRect,
}
#[test]
fn bindgen_test_layout_ULGPUState() {
    assert_eq!(
        ::std::mem::size_of::<ULGPUState>(),
        788usize,
        concat!("Size of: ", stringify!(ULGPUState))
    );
    assert_eq!(
        ::std::mem::align_of::<ULGPUState>(),
        4usize,
        concat!("Alignment of ", stringify!(ULGPUState))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUState>())).viewport_width as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUState),
            "::",
            stringify!(viewport_width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUState>())).viewport_height as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUState),
            "::",
            stringify!(viewport_height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUState>())).transform as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUState),
            "::",
            stringify!(transform)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUState>())).enable_texturing as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUState),
            "::",
            stringify!(enable_texturing)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUState>())).enable_blend as *const _ as usize },
        73usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUState),
            "::",
            stringify!(enable_blend)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUState>())).shader_type as *const _ as usize },
        74usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUState),
            "::",
            stringify!(shader_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUState>())).render_buffer_id as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUState),
            "::",
            stringify!(render_buffer_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUState>())).texture_1_id as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUState),
            "::",
            stringify!(texture_1_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUState>())).texture_2_id as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUState),
            "::",
            stringify!(texture_2_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUState>())).texture_3_id as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUState),
            "::",
            stringify!(texture_3_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUState>())).uniform_scalar as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUState),
            "::",
            stringify!(uniform_scalar)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUState>())).uniform_vector as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUState),
            "::",
            stringify!(uniform_vector)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUState>())).clip_size as *const _ as usize },
        252usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUState),
            "::",
            stringify!(clip_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUState>())).clip as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUState),
            "::",
            stringify!(clip)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUState>())).enable_scissor as *const _ as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUState),
            "::",
            stringify!(enable_scissor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUState>())).scissor_rect as *const _ as usize },
        772usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUState),
            "::",
            stringify!(scissor_rect)
        )
    );
}
pub const ULCommandType_kCommandType_ClearRenderBuffer: ULCommandType = 0;
pub const ULCommandType_kCommandType_DrawGeometry: ULCommandType = 1;
#[doc = ""]
#[doc = " Command types, used with ULCommand::command_type"]
#[doc = ""]
pub type ULCommandType = ::std::os::raw::c_uint;
#[doc = ""]
#[doc = " Command description."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ULCommand {
    pub command_type: ::std::os::raw::c_uchar,
    pub gpu_state: ULGPUState,
    #[doc = " The following members are only used with kCommandType_DrawGeometry"]
    pub geometry_id: ::std::os::raw::c_uint,
    pub indices_count: ::std::os::raw::c_uint,
    pub indices_offset: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_ULCommand() {
    assert_eq!(
        ::std::mem::size_of::<ULCommand>(),
        804usize,
        concat!("Size of: ", stringify!(ULCommand))
    );
    assert_eq!(
        ::std::mem::align_of::<ULCommand>(),
        4usize,
        concat!("Alignment of ", stringify!(ULCommand))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULCommand>())).command_type as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ULCommand),
            "::",
            stringify!(command_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULCommand>())).gpu_state as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ULCommand),
            "::",
            stringify!(gpu_state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULCommand>())).geometry_id as *const _ as usize },
        792usize,
        concat!(
            "Offset of field: ",
            stringify!(ULCommand),
            "::",
            stringify!(geometry_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULCommand>())).indices_count as *const _ as usize },
        796usize,
        concat!(
            "Offset of field: ",
            stringify!(ULCommand),
            "::",
            stringify!(indices_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULCommand>())).indices_offset as *const _ as usize },
        800usize,
        concat!(
            "Offset of field: ",
            stringify!(ULCommand),
            "::",
            stringify!(indices_offset)
        )
    );
}
#[doc = ""]
#[doc = " Command list, @see ULGPUDriverUpdateCommandList"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ULCommandList {
    pub size: ::std::os::raw::c_uint,
    pub commands: *mut ULCommand,
}
#[test]
fn bindgen_test_layout_ULCommandList() {
    assert_eq!(
        ::std::mem::size_of::<ULCommandList>(),
        16usize,
        concat!("Size of: ", stringify!(ULCommandList))
    );
    assert_eq!(
        ::std::mem::align_of::<ULCommandList>(),
        8usize,
        concat!("Alignment of ", stringify!(ULCommandList))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULCommandList>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ULCommandList),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULCommandList>())).commands as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ULCommandList),
            "::",
            stringify!(commands)
        )
    );
}
#[doc = ""]
#[doc = " The callback invoked when the GPUDriver will begin dispatching commands (such as CreateTexture"]
#[doc = " and UpdateCommandList) during the current call to ulRender()."]
#[doc = ""]
pub type ULGPUDriverBeginSynchronizeCallback = ::std::option::Option<unsafe extern "C" fn()>;
#[doc = ""]
#[doc = " The callback invoked when the GPUDriver has finished dispatching commands during the current"]
#[doc = " call to ulRender()."]
#[doc = ""]
pub type ULGPUDriverEndSynchronizeCallback = ::std::option::Option<unsafe extern "C" fn()>;
#[doc = ""]
#[doc = " The callback invoked when the GPUDriver wants to get the next available texture ID."]
#[doc = ""]
pub type ULGPUDriverNextTextureIdCallback =
    ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_uint>;
#[doc = ""]
#[doc = " The callback invoked when the GPUDriver wants to create a texture with a"]
#[doc = " certain ID and optional bitmap."]
#[doc = ""]
#[doc = " @note: If the Bitmap is empty (ulBitmapIsEmpty), then a RTT Texture should be created"]
#[doc = "        instead. This will be used as a backing texture for a new RenderBuffer."]
#[doc = ""]
pub type ULGPUDriverCreateTextureCallback = ::std::option::Option<
    unsafe extern "C" fn(texture_id: ::std::os::raw::c_uint, bitmap: ULBitmap),
>;
#[doc = ""]
#[doc = " The callback invoked when the GPUDriver wants to update an existing non-RTT texture with new"]
#[doc = " bitmap data."]
#[doc = ""]
pub type ULGPUDriverUpdateTextureCallback = ::std::option::Option<
    unsafe extern "C" fn(texture_id: ::std::os::raw::c_uint, bitmap: ULBitmap),
>;
#[doc = ""]
#[doc = " The callback invoked when the GPUDriver wants to destroy a texture."]
#[doc = ""]
pub type ULGPUDriverDestroyTextureCallback =
    ::std::option::Option<unsafe extern "C" fn(texture_id: ::std::os::raw::c_uint)>;
#[doc = ""]
#[doc = " The callback invoked when the GPUDriver wants to generate the next available render buffer ID."]
#[doc = ""]
pub type ULGPUDriverNextRenderBufferIdCallback =
    ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_uint>;
#[doc = ""]
#[doc = " The callback invoked when the GPUDriver wants to create a render buffer with certain ID and"]
#[doc = " buffer description."]
#[doc = ""]
pub type ULGPUDriverCreateRenderBufferCallback = ::std::option::Option<
    unsafe extern "C" fn(render_buffer_id: ::std::os::raw::c_uint, buffer: ULRenderBuffer),
>;
#[doc = ""]
#[doc = " The callback invoked when the GPUDriver wants to destroy a render buffer"]
#[doc = ""]
pub type ULGPUDriverDestroyRenderBufferCallback =
    ::std::option::Option<unsafe extern "C" fn(render_buffer_id: ::std::os::raw::c_uint)>;
#[doc = ""]
#[doc = " The callback invoked when the GPUDriver wants to generate the next available geometry ID."]
#[doc = ""]
pub type ULGPUDriverNextGeometryIdCallback =
    ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_uint>;
#[doc = ""]
#[doc = " The callback invoked when the GPUDriver wants to create geometry with certain ID and"]
#[doc = " vertex/index data."]
#[doc = ""]
pub type ULGPUDriverCreateGeometryCallback = ::std::option::Option<
    unsafe extern "C" fn(
        geometry_id: ::std::os::raw::c_uint,
        vertices: ULVertexBuffer,
        indices: ULIndexBuffer,
    ),
>;
#[doc = ""]
#[doc = " The callback invoked when the GPUDriver wants to update existing geometry with new vertex/index"]
#[doc = " data."]
#[doc = ""]
pub type ULGPUDriverUpdateGeometryCallback = ::std::option::Option<
    unsafe extern "C" fn(
        geometry_id: ::std::os::raw::c_uint,
        vertices: ULVertexBuffer,
        indices: ULIndexBuffer,
    ),
>;
#[doc = ""]
#[doc = " The callback invoked when the GPUDriver wants to destroy geometry."]
#[doc = ""]
pub type ULGPUDriverDestroyGeometryCallback =
    ::std::option::Option<unsafe extern "C" fn(geometry_id: ::std::os::raw::c_uint)>;
#[doc = ""]
#[doc = " The callback invoked when the GPUDriver wants to update the command list (you should copy the"]
#[doc = " commands to your own structure)."]
#[doc = ""]
pub type ULGPUDriverUpdateCommandListCallback =
    ::std::option::Option<unsafe extern "C" fn(list: ULCommandList)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ULGPUDriver {
    pub begin_synchronize: ULGPUDriverBeginSynchronizeCallback,
    pub end_synchronize: ULGPUDriverEndSynchronizeCallback,
    pub next_texture_id: ULGPUDriverNextTextureIdCallback,
    pub create_texture: ULGPUDriverCreateTextureCallback,
    pub update_texture: ULGPUDriverUpdateTextureCallback,
    pub destroy_texture: ULGPUDriverDestroyTextureCallback,
    pub next_render_buffer_id: ULGPUDriverNextRenderBufferIdCallback,
    pub create_render_buffer: ULGPUDriverCreateRenderBufferCallback,
    pub destroy_render_buffer: ULGPUDriverDestroyRenderBufferCallback,
    pub next_geometry_id: ULGPUDriverNextGeometryIdCallback,
    pub create_geometry: ULGPUDriverCreateGeometryCallback,
    pub update_geometry: ULGPUDriverUpdateGeometryCallback,
    pub destroy_geometry: ULGPUDriverDestroyGeometryCallback,
    pub update_command_list: ULGPUDriverUpdateCommandListCallback,
}
#[test]
fn bindgen_test_layout_ULGPUDriver() {
    assert_eq!(
        ::std::mem::size_of::<ULGPUDriver>(),
        112usize,
        concat!("Size of: ", stringify!(ULGPUDriver))
    );
    assert_eq!(
        ::std::mem::align_of::<ULGPUDriver>(),
        8usize,
        concat!("Alignment of ", stringify!(ULGPUDriver))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUDriver>())).begin_synchronize as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUDriver),
            "::",
            stringify!(begin_synchronize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUDriver>())).end_synchronize as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUDriver),
            "::",
            stringify!(end_synchronize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUDriver>())).next_texture_id as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUDriver),
            "::",
            stringify!(next_texture_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUDriver>())).create_texture as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUDriver),
            "::",
            stringify!(create_texture)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUDriver>())).update_texture as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUDriver),
            "::",
            stringify!(update_texture)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUDriver>())).destroy_texture as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUDriver),
            "::",
            stringify!(destroy_texture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ULGPUDriver>())).next_render_buffer_id as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUDriver),
            "::",
            stringify!(next_render_buffer_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ULGPUDriver>())).create_render_buffer as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUDriver),
            "::",
            stringify!(create_render_buffer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ULGPUDriver>())).destroy_render_buffer as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUDriver),
            "::",
            stringify!(destroy_render_buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUDriver>())).next_geometry_id as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUDriver),
            "::",
            stringify!(next_geometry_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUDriver>())).create_geometry as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUDriver),
            "::",
            stringify!(create_geometry)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUDriver>())).update_geometry as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUDriver),
            "::",
            stringify!(update_geometry)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUDriver>())).destroy_geometry as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUDriver),
            "::",
            stringify!(destroy_geometry)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULGPUDriver>())).update_command_list as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ULGPUDriver),
            "::",
            stringify!(update_command_list)
        )
    );
}
extern "C" {
    #[doc = ""]
    #[doc = " Sets up an orthographic projection matrix with a certain viewport width and height, multiplies"]
    #[doc = " it by 'transform', and returns the result."]
    #[doc = ""]
    #[doc = " This should be used to calculate the model-view projection matrix for the vertex shaders using"]
    #[doc = " the current ULGPUState."]
    #[doc = ""]
    #[doc = " The 'flip_y' can be optionally used to flip the Y coordinate-space. (Usually flip_y == true for"]
    #[doc = " OpenGL)"]
    #[doc = ""]
    pub fn ulApplyProjection(
        transform: ULMatrix4x4,
        viewport_width: f32,
        viewport_height: f32,
        flip_y: bool,
    ) -> ULMatrix4x4;
}
extern "C" {
    #[doc = ""]
    #[doc = " Create a key event, @see KeyEvent for help with the following parameters."]
    #[doc = ""]
    pub fn ulCreateKeyEvent(
        type_: ULKeyEventType,
        modifiers: ::std::os::raw::c_uint,
        virtual_key_code: ::std::os::raw::c_int,
        native_key_code: ::std::os::raw::c_int,
        text: ULString,
        unmodified_text: ULString,
        is_keypad: bool,
        is_auto_repeat: bool,
        is_system_key: bool,
    ) -> ULKeyEvent;
}
extern "C" {
    #[doc = ""]
    #[doc = " Destroy a key event."]
    #[doc = ""]
    pub fn ulDestroyKeyEvent(evt: ULKeyEvent);
}
pub const ULLogLevel_kLogLevel_Error: ULLogLevel = 0;
pub const ULLogLevel_kLogLevel_Warning: ULLogLevel = 1;
pub const ULLogLevel_kLogLevel_Info: ULLogLevel = 2;
#[doc = " Logger"]
pub type ULLogLevel = ::std::os::raw::c_uint;
#[doc = ""]
#[doc = " The callback invoked when the library wants to print a message to the log."]
#[doc = ""]
pub type ULLoggerLogMessageCallback =
    ::std::option::Option<unsafe extern "C" fn(log_level: ULLogLevel, message: ULString)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ULLogger {
    pub log_message: ULLoggerLogMessageCallback,
}
#[test]
fn bindgen_test_layout_ULLogger() {
    assert_eq!(
        ::std::mem::size_of::<ULLogger>(),
        8usize,
        concat!("Size of: ", stringify!(ULLogger))
    );
    assert_eq!(
        ::std::mem::align_of::<ULLogger>(),
        8usize,
        concat!("Alignment of ", stringify!(ULLogger))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULLogger>())).log_message as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ULLogger),
            "::",
            stringify!(log_message)
        )
    );
}
extern "C" {
    #[doc = ""]
    #[doc = " Create a mouse event, @see MouseEvent for help using this function."]
    #[doc = ""]
    pub fn ulCreateMouseEvent(
        type_: ULMouseEventType,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
        button: ULMouseButton,
    ) -> ULMouseEvent;
}
extern "C" {
    #[doc = ""]
    #[doc = " Destroy a mouse event."]
    #[doc = ""]
    pub fn ulDestroyMouseEvent(evt: ULMouseEvent);
}
extern "C" {
    #[doc = ""]
    #[doc = " Width (in pixels)."]
    #[doc = ""]
    pub fn ulSurfaceGetWidth(surface: ULSurface) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = ""]
    #[doc = " Height (in pixels)."]
    #[doc = ""]
    pub fn ulSurfaceGetHeight(surface: ULSurface) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = ""]
    #[doc = " Number of bytes between rows (usually width * 4)"]
    #[doc = ""]
    pub fn ulSurfaceGetRowBytes(surface: ULSurface) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = ""]
    #[doc = " Size in bytes."]
    #[doc = ""]
    pub fn ulSurfaceGetSize(surface: ULSurface) -> size_t;
}
extern "C" {
    #[doc = ""]
    #[doc = " Lock the pixel buffer and get a pointer to the beginning of the data for reading/writing."]
    #[doc = ""]
    #[doc = " Native pixel format is premultiplied BGRA 32-bit (8 bits per channel)."]
    #[doc = ""]
    pub fn ulSurfaceLockPixels(surface: ULSurface) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = ""]
    #[doc = " Unlock the pixel buffer."]
    #[doc = ""]
    pub fn ulSurfaceUnlockPixels(surface: ULSurface);
}
extern "C" {
    #[doc = ""]
    #[doc = " Resize the pixel buffer to a certain width and height (both in pixels)."]
    #[doc = ""]
    #[doc = " This should never be called while pixels are locked."]
    #[doc = ""]
    pub fn ulSurfaceResize(
        surface: ULSurface,
        width: ::std::os::raw::c_uint,
        height: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[doc = ""]
    #[doc = " Set the dirty bounds to a certain value."]
    #[doc = ""]
    #[doc = " This is called after the Renderer paints to an area of the pixel buffer. (The new value will be"]
    #[doc = " joined with the existing dirty_bounds())"]
    #[doc = ""]
    pub fn ulSurfaceSetDirtyBounds(surface: ULSurface, bounds: ULIntRect);
}
extern "C" {
    #[doc = ""]
    #[doc = " Get the dirty bounds."]
    #[doc = ""]
    #[doc = " This value can be used to determine which portion of the pixel buffer has been updated since the"]
    #[doc = " last call to ulSurfaceClearDirtyBounds()."]
    #[doc = ""]
    #[doc = " The general algorithm to determine if a Surface needs display is:"]
    #[doc = " <pre>"]
    #[doc = "   if (!ulIntRectIsEmpty(ulSurfaceGetDirtyBounds(surface))) {"]
    #[doc = "       // Surface pixels are dirty and needs display."]
    #[doc = "       // Cast Surface to native Surface and use it here (pseudo code)"]
    #[doc = "       DisplaySurface(surface);"]
    #[doc = ""]
    #[doc = "       // Once you're done, clear the dirty bounds:"]
    #[doc = "       ulSurfaceClearDirtyBounds(surface);"]
    #[doc = "  }"]
    #[doc = "  </pre>"]
    #[doc = ""]
    pub fn ulSurfaceGetDirtyBounds(surface: ULSurface) -> ULIntRect;
}
extern "C" {
    #[doc = ""]
    #[doc = " Clear the dirty bounds."]
    #[doc = ""]
    #[doc = " You should call this after you're done displaying the Surface."]
    #[doc = ""]
    pub fn ulSurfaceClearDirtyBounds(surface: ULSurface);
}
extern "C" {
    #[doc = ""]
    #[doc = " Get the underlying user data pointer (this is only valid if you have set a custom surface"]
    #[doc = " implementation via ulPlatformSetSurfaceDefinition)."]
    #[doc = ""]
    #[doc = " This will return nullptr if this surface is the default ULBitmapSurface."]
    #[doc = ""]
    pub fn ulSurfaceGetUserData(surface: ULSurface) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = ""]
    #[doc = " Get the underlying Bitmap from the default Surface."]
    #[doc = ""]
    #[doc = " @note  Do not call ulDestroyBitmap() on the returned value, it is owned by the surface."]
    #[doc = ""]
    pub fn ulBitmapSurfaceGetBitmap(surface: ULBitmapSurface) -> ULBitmap;
}
#[doc = ""]
#[doc = " The callback invoked when a Surface is created."]
#[doc = ""]
#[doc = " @param  width  The width in pixels."]
#[doc = " @param  height  The height in pixels."]
#[doc = ""]
#[doc = " @return  This callback should return a pointer to user-defined data for the instance. This user"]
#[doc = "          data pointer will be passed to all other callbacks when operating on the instance."]
#[doc = ""]
pub type ULSurfaceDefinitionCreateCallback = ::std::option::Option<
    unsafe extern "C" fn(
        width: ::std::os::raw::c_uint,
        height: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void,
>;
#[doc = ""]
#[doc = " The callback invoked when a Surface is destroyed."]
#[doc = ""]
#[doc = " @param  user_data  User data pointer uniquely identifying the surface."]
#[doc = ""]
pub type ULSurfaceDefinitionDestroyCallback =
    ::std::option::Option<unsafe extern "C" fn(user_data: *mut ::std::os::raw::c_void)>;
#[doc = ""]
#[doc = " The callback invoked when a Surface's width (in pixels) is requested."]
#[doc = ""]
#[doc = " @param  user_data  User data pointer uniquely identifying the surface."]
#[doc = ""]
pub type ULSurfaceDefinitionGetWidthCallback = ::std::option::Option<
    unsafe extern "C" fn(user_data: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_uint,
>;
#[doc = ""]
#[doc = " The callback invoked when a Surface's height (in pixels) is requested."]
#[doc = ""]
#[doc = " @param  user_data  User data pointer uniquely identifying the surface."]
#[doc = ""]
pub type ULSurfaceDefinitionGetHeightCallback = ::std::option::Option<
    unsafe extern "C" fn(user_data: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_uint,
>;
#[doc = ""]
#[doc = " The callback invoked when a Surface's row bytes is requested."]
#[doc = ""]
#[doc = " @note  This value is also known as \"stride\". Usually width * 4."]
#[doc = ""]
#[doc = " @param  user_data  User data pointer uniquely identifying the surface."]
#[doc = ""]
pub type ULSurfaceDefinitionGetRowBytesCallback = ::std::option::Option<
    unsafe extern "C" fn(user_data: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_uint,
>;
#[doc = ""]
#[doc = " The callback invoked when a Surface's size (in bytes) is requested."]
#[doc = ""]
#[doc = " @param  user_data  User data pointer uniquely identifying the surface."]
#[doc = ""]
pub type ULSurfaceDefinitionGetSizeCallback =
    ::std::option::Option<unsafe extern "C" fn(user_data: *mut ::std::os::raw::c_void) -> size_t>;
#[doc = ""]
#[doc = " The callback invoked when a Surface's pixel buffer is requested to be locked for reading/writing"]
#[doc = " (should return a pointer to locked bytes)."]
#[doc = ""]
#[doc = " @param  user_data  User data pointer uniquely identifying the surface."]
#[doc = ""]
pub type ULSurfaceDefinitionLockPixelsCallback = ::std::option::Option<
    unsafe extern "C" fn(user_data: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
>;
#[doc = ""]
#[doc = " The callback invoked when a Surface's pixel buffer is requested to be unlocked after previously"]
#[doc = " being locked."]
#[doc = ""]
#[doc = " @param  user_data  User data pointer uniquely identifying the surface."]
#[doc = ""]
pub type ULSurfaceDefinitionUnlockPixelsCallback =
    ::std::option::Option<unsafe extern "C" fn(user_data: *mut ::std::os::raw::c_void)>;
#[doc = ""]
#[doc = " The callback invoked when a Surface is requested to be resized to a certain width/height."]
#[doc = ""]
#[doc = " @param  user_data  User data pointer uniquely identifying the surface."]
#[doc = ""]
#[doc = " @param  width      Width in pixels."]
#[doc = ""]
#[doc = " @param  height     Height in pixels."]
#[doc = ""]
pub type ULSurfaceDefinitionResizeCallback = ::std::option::Option<
    unsafe extern "C" fn(
        user_data: *mut ::std::os::raw::c_void,
        width: ::std::os::raw::c_uint,
        height: ::std::os::raw::c_uint,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ULSurfaceDefinition {
    pub create: ULSurfaceDefinitionCreateCallback,
    pub destroy: ULSurfaceDefinitionDestroyCallback,
    pub get_width: ULSurfaceDefinitionGetWidthCallback,
    pub get_height: ULSurfaceDefinitionGetHeightCallback,
    pub get_row_bytes: ULSurfaceDefinitionGetRowBytesCallback,
    pub get_size: ULSurfaceDefinitionGetSizeCallback,
    pub lock_pixels: ULSurfaceDefinitionLockPixelsCallback,
    pub unlock_pixels: ULSurfaceDefinitionUnlockPixelsCallback,
    pub resize: ULSurfaceDefinitionResizeCallback,
}
#[test]
fn bindgen_test_layout_ULSurfaceDefinition() {
    assert_eq!(
        ::std::mem::size_of::<ULSurfaceDefinition>(),
        72usize,
        concat!("Size of: ", stringify!(ULSurfaceDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<ULSurfaceDefinition>(),
        8usize,
        concat!("Alignment of ", stringify!(ULSurfaceDefinition))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULSurfaceDefinition>())).create as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ULSurfaceDefinition),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULSurfaceDefinition>())).destroy as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ULSurfaceDefinition),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULSurfaceDefinition>())).get_width as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ULSurfaceDefinition),
            "::",
            stringify!(get_width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULSurfaceDefinition>())).get_height as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ULSurfaceDefinition),
            "::",
            stringify!(get_height)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ULSurfaceDefinition>())).get_row_bytes as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ULSurfaceDefinition),
            "::",
            stringify!(get_row_bytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULSurfaceDefinition>())).get_size as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ULSurfaceDefinition),
            "::",
            stringify!(get_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULSurfaceDefinition>())).lock_pixels as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ULSurfaceDefinition),
            "::",
            stringify!(lock_pixels)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ULSurfaceDefinition>())).unlock_pixels as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ULSurfaceDefinition),
            "::",
            stringify!(unlock_pixels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ULSurfaceDefinition>())).resize as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ULSurfaceDefinition),
            "::",
            stringify!(resize)
        )
    );
}
extern "C" {
    #[doc = ""]
    #[doc = " Set a custom Logger implementation."]
    #[doc = ""]
    #[doc = " This is used to log debug messages to the console or to a log file."]
    #[doc = ""]
    #[doc = " You should call this before ulCreateRenderer() or ulCreateApp()."]
    #[doc = ""]
    #[doc = " @note  ulCreateApp() will use the default logger if you never call this."]
    #[doc = ""]
    #[doc = " @note  If you're not using ulCreateApp(), (eg, using ulCreateRenderer()) you can still use the"]
    #[doc = "        default logger by calling ulEnableDefaultLogger() (@see <AppCore/CAPI.h>)"]
    #[doc = ""]
    pub fn ulPlatformSetLogger(logger: ULLogger);
}
extern "C" {
    #[doc = ""]
    #[doc = " Set a custom FileSystem implementation."]
    #[doc = ""]
